{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}ML noML
       {txt}log:  {res}/Users/cjr/Repos/fhi.ml-resource-time.2023/products/log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 9 Mar 2023, 10:31:36
{txt}
{com}. 
. // Set up globals.
. do globals/globals
{txt}
{com}. version 16.1
{txt}
{com}. 
. global data_file  "data/raw/Blinded data sheet_060323 - Downloaded 07-03-2023.xlsx"
{txt}
{com}. global sheet_name "Data Extraction Form"
{txt}
{com}. global cellrange  A1:AC40
{txt}
{com}. global signature "39:29(69325):2253827172:810722692"
{txt}
{com}. 
. global random_seed 1234
{txt}
{com}. 
. global p_threshold 0.0001
{txt}
{com}. 
. global report_filename "products/ml-resource-time-report.docx"
{txt}
{com}. 
. // Define the comparisons specified in the protocol published in the journal.
. global comparisons rec_vs_none rec_vs_nonrec any_vs_none 
{txt}
{com}. 
. // Define the outcomes.
. global outcomes resource time
{txt}
{com}. 
. // Define the outcome variables.
. global resource_outcome log_resource1 log_resource2
{txt}
{com}. // Note: No need to specify outcomes for stset data.
. 
. // Define fixed effect covariate.
. global adj_var i.meta_analysis_planned
{txt}
{com}. 
. // Specify the model for endogeneous treatment assignment.
. global endo_vars i.field i.prespecified
{txt}
{com}. 
{txt}end of do-file

{com}. do globals/models
{txt}
{com}. version 16.1
{txt}
{com}. 
. foreach comparison of global comparisons {c -(}
{txt}  2{com}.   global `comparison'_resource_model eintreg ${c -(}resource_outcome{c )-} ${c -(}adj_var{c )-} , entreat(`comparison' = ${c -(}endo_vars{c )-} , nointeract)
{txt}  3{com}.   global `comparison'_time_model     stteffects ipwra (${c -(}adj_var{c )-}) (`comparison' ${c -(}endo_vars{c )-}) , aequations
{txt}  4{com}. {c )-}
{txt}
{com}. 
. // Override the following analyses because there is no clear evidence of endogenicity for treatment assignment
. // for field or prespecification, except on the basis of an exploratory logistic regression that suggests that
. // field may predict treatment assignment.
. global rec_vs_nonrec_resource_model intreg ${c -(}resource_outcome{c )-} i.rec_vs_nonrec ${c -(}adj_var{c )-}
{txt}
{com}. 
{txt}end of do-file

{com}. 
. // Set up Stata.
. do setup/setup
{txt}
{com}. version 16.1
{txt}
{com}. 
. // Set the random number generator seed.
. set rng  mt64s
{txt}
{com}. set seed ${c -(}random_seed{c )-}
{txt}
{com}. set rngstream 1
{txt}
{com}. 
. // Set up Stata's path to use the "packages" directory for add-on packages.
. net set ado "./packages"
{txt}
{com}. sysdir set PERSONAL "./packages"
{txt}
{com}. 
. // Specify formats.
. set cformat %9.2f
{txt}
{com}. set pformat %5.2f
{txt}
{com}. set sformat %8.2f
{txt}
{com}. 
{txt}end of do-file

{com}. 
. // Import and process the data.
. do data/data
{txt}
{com}. version 16.1
{txt}
{com}. 
. // Load the data and check its signature is as expected.
. import excel "${c -(}data_file{c )-}", sheet("${c -(}sheet_name{c )-}") cellrange(${c -(}cellrange{c )-}) firstrow allstring
{res}{text}(29 vars, 39 obs)

{com}. datasignature
  {res}39:29(69325):2253827172:810722692
{txt}
{com}. assert r(datasignature) == "${c -(}signature{c )-}"
{txt}
{com}. 
. // Define a variable that specifies the product's year.
. tempvar year
{txt}
{com}. rename Year `year'
{res}{txt}
{com}. destring `year', generate(year)
{txt}__000000: all characters numeric; year {res}generated {txt}as {res}int
{txt}
{com}. 
. // Rename and encode the health/welfare variable.
. tempvar field
{txt}
{com}. rename AreaHealthorWelfare `field'
{res}{txt}
{com}. replace `field' = "Healthcare" if `field' == "H"
{txt}variable {bf}__000001{sf} was {bf}{res}str1{sf}{txt} now {bf}{res}str10{sf}
{txt}(19 real changes made)

{com}. replace `field' = "Welfare"    if `field' == "W"
{txt}(20 real changes made)

{com}. encode `field' , generate(field)
{txt}
{com}. 
. // Rename and encode the variable that codes for the type of product.
. tempvar product_type
{txt}
{com}. rename Typeofproduct `product_type'
{res}{txt}
{com}. encode `product_type', generate(product_type)
{txt}
{com}. 
. // Rename and encode the variable that codes for whether product is an update.
. tempvar update
{txt}
{com}. rename UpdateYN `update'
{res}{txt}
{com}. replace `update' = strtrim(`update')
{txt}(2 real changes made)

{com}. encode `update', generate(update)
{txt}
{com}. 
. // Rename and encode the variable that codes for whether product is an HTA.
. tempvar hta
{txt}
{com}. rename HTAYorN `hta'
{res}{txt}
{com}. encode `hta', generate(hta)
{txt}
{com}. 
. // Define treatment variables.
. // Treatment variables will contain valid missing values, e.g. for recommended vs none where some reviews used non-recomended ML.
. local treatments RecommendedvsNone RecommendedvsNonrecom AnyvsNone Recomvsunderuse Recomvsoveruse
{txt}
{com}. local RecommendedvsNone     rec_vs_none   // New variable name.
{txt}
{com}. local RecommendedvsNonrecom rec_vs_nonrec // New variable name.
{txt}
{com}. local AnyvsNone             any_vs_none   // New variable name.
{txt}
{com}. local Recomvsunderuse       rec_vs_under  // New variable name.
{txt}
{com}. local Recomvsoveruse        rec_vs_over   // New variable name.
{txt}
{com}. foreach t of local treatments {c -(}
{txt}  2{com}.   replace `t' = "" if !regexm(`t', "[A-Z]") // Non-missing values are letters in [A-Z]
{txt}  3{com}.   encode  `t', generate(``t'')
{txt}  4{com}.   drop `t'
{txt}  5{com}. {c )-}
{txt}(6 real changes made)
(12 real changes made)
(0 real changes made)
(14 real changes made)
(18 real changes made)

{com}. 
. // Define the variable labels for the comaprisons.
. label variable rec_vs_none   "Recommended vs No ML Use"
{txt}
{com}. label variable rec_vs_nonrec "Recommended vs Non-recommended ML Use"
{txt}
{com}. label variable any_vs_none   "Any vs No ML Use"
{txt}
{com}. // Note: We do not use the other comparisons, so will not rename them.
. 
. // Define a value label for analyses that can be prespecified.
. label define planned 0 No 1 Yes
{txt}
{com}. 
. // Define variables that code for prespecified synthesis (any), meta-analysis (incl.
. // quantitative and qualitative), and NMA.
. local planned ProtocolavailableYorN SynthesisplannednoneYorN SynthesisplannedMetaAnalysis SynthesisplannedNMAYorN
{txt}
{com}. local ProtocolavailableYorN        prespecified          // New variable name.
{txt}
{com}. local SynthesisplannednoneYorN     synthesis_planned     // New variable name.
{txt}
{com}. local SynthesisplannedMetaAnalysis meta_analysis_planned // New variable name.
{txt}
{com}. local SynthesisplannedNMAYorN      nma_planned           // New variable name.
{txt}
{com}. local prespecified_label          "Was the work pre-specified?"
{txt}
{com}. local synthesis_planned_label     "Was any synthesis planned?"
{txt}
{com}. local meta_analysis_planned_label "Was meta-analysis planned?"
{txt}
{com}. local nma_planned_label           "Was NMA planned?"
{txt}
{com}. foreach p of local planned {c -(}
{txt}  2{com}.   generate       ``p'' = 0
{txt}  3{com}.   replace        ``p'' = 1 if `p' != "N" // Works for one value coded "Both".
{txt}  4{com}.   label values   ``p'' planned
{txt}  5{com}.   label variable ``p'' "```p''_label'"
{txt}  6{com}.   drop `p'
{txt}  7{com}. {c )-}
{txt}(26 real changes made)
(20 real changes made)
(18 real changes made)
(0 real changes made)

{com}. 
. // Define a completed variable (analogous to a failure indicator in survival analysis).
. generate          completed = 1
{txt}
{com}. replace           completed = 0 if OngoingYorN == "Y"
{txt}(3 real changes made)

{com}. label    define   completed 0 No 1 Yes
{txt}
{com}. label    values   completed completed
{txt}
{com}. label    variable completed "Report completed?"
{txt}
{com}. drop OngoingYorN
{txt}
{com}. 
. // Define the resource use variable.
. tempvar resource
{txt}
{com}. rename ResourceUsePersonHours `resource'
{res}{txt}
{com}. destring `resource', replace force // One missing outcome. TODO: Note this in the report.
{txt}__000005: contains nonnumeric characters; {res}replaced {txt}as {res}int
{txt}(1 missing value generated)
{res}{txt}
{com}. generate log_resource1 = log(`resource')
{txt}(1 missing value generated)

{com}. generate log_resource2 = log(`resource')
{txt}(1 missing value generated)

{com}. replace  log_resource2 = . if !completed // For right-censored data.
{txt}(3 real changes made, 3 to missing)

{com}. label variable log_resource1 "Resource use (log person-hours)"
{txt}
{com}. label variable log_resource2 "Resource use (log person-hours); possibly censored"
{txt}
{com}. 
. // Define commision date variable.
. tempvar c_day c_month c_year commission
{txt}
{com}. rename CommissionDay131   `c_day'
{res}{txt}
{com}. rename CommissionMonth112 `c_month'
{res}{txt}
{com}. rename CommissionYear2020 `c_year'
{res}{txt}
{com}. generate `commission' = `c_day' + "/" + `c_month' + "/" + `c_year'
{txt}
{com}. generate commission = date(`commission', "DMY")
{txt}
{com}. 
. // Define completion date variable.
. tempvar c_day c_month c_year completion
{txt}
{com}. rename CompletionDay131   `c_day'
{res}{txt}
{com}. rename CompletionMonth112 `c_month'
{res}{txt}
{com}. rename CompletionYear2020 `c_year'
{res}{txt}
{com}. generate `completion' = `c_day' + "/" + `c_month' + "/" + `c_year'
{txt}
{com}. generate completion = date(`completion', "DMY")
{txt}(3 missing values generated)

{com}. // Set right-censoring date for ongoing reviews.
. replace completion = date("31/01/2023", "DMY") if missing(completion) // Date at end of data extraction.
{txt}(3 real changes made)

{com}. 
. // stset the data.
. stset completion , failure(completed) origin(time commission) scale(7 /*days*/)

     {txt}failure event:  {res}completed != 0 & completed < .
{txt}obs. time interval:  {res}(origin, completion]
{txt} exit on or before:  {res}failure
    {txt}t for analysis:  {res}(time-origin)/7
            {txt}origin:  {res}time commission

{txt}{hline 78}
{res}         39{txt}  total observations
{res}          0{txt}  exclusions
{hline 78}
{res}         39{txt}  observations remaining, representing
{res}         36{txt}  failures in single-record/single-failure data
{res}  1,236.286{txt}  total analysis time at risk and under observation
                                                at risk from t = {res}        0
                                     {txt}earliest observed entry t = {res}        0
                                          {txt}last observed exit t = {res} 102.1429
{txt}
{com}. 
. // We do not have data on number of downloads or comissioner satisfaction.
. drop Commissionersatisfactionoveral Numberofdownloadstodate
{txt}
{com}. 
. // Ensure that there are no NMAs in the sample.
. levelsof nma_planned
{res}{txt}0

{com}. assert r(r) == 1 // Multiple levels would indicate ≥1 NMA.
{txt}
{com}. 
. // TODO: Drop other variables with uppercase first letters?
. 
{txt}end of do-file

{com}. 
. // Do estimation.
. do estimation/estimate
{txt}
{com}. version 16.1
{txt}
{com}. 
. // Perform estimation.
. foreach comparison of global comparisons {c -(}
{txt}  2{com}.   foreach outcome of global outcomes {c -(}
{txt}  3{com}.     disp "{c -(}hline{c )-}"
{txt}  4{com}.     disp as result "Analysis for: {c -(}ul:`comparison'{c )-} with respect to {c -(}ul:`outcome'{c )-}"
{txt}  5{com}. 
.     // Perform estimation and store the estimates.
.     ${c -(}`comparison'_`outcome'_model{c )-}
{txt}  6{com}.     assert e(converged)
{txt}  7{com}.     estimates store `comparison'_`outcome'
{txt}  8{com}. 
.     // Compute and test residuals for normality for eintreg.
.     if regexm("`e(cmd)'", "intreg") {c -(} // Match eintreg and intreg.
{txt}  9{com}.       tempvar y_hat resid
{txt} 10{com}.       predict `y_hat'
{txt} 11{com}.       local y : word 1 of `e(depvar)'
{txt} 12{com}.       generate `resid' = `y' - `y_hat' if completed // Limit to uncensored observations.
{txt} 13{com}.       swilk `resid'
{txt} 14{com}.       assert r(p) > 0.05
{txt} 15{com}.     {c )-}
{txt} 16{com}.   {c )-}
{txt} 17{com}. {c )-}
{hline}
{res}Analysis for: {ul:rec_vs_none} with respect to {ul:resource}

{txt}Iteration 0:{space 3}log likelihood = {res:-48.854513}  (not concave)
Iteration 1:{space 3}log likelihood = {res:-47.539267}  
Iteration 2:{space 3}log likelihood = {res:-46.952625}  
Iteration 3:{space 3}log likelihood = {res: -46.78175}  
Iteration 4:{space 3}log likelihood = {res:-46.747541}  (not concave)
Iteration 5:{space 3}log likelihood = {res:-46.735474}  (not concave)
Iteration 6:{space 3}log likelihood = {res:-46.733904}  (not concave)
Iteration 7:{space 3}log likelihood = {res:-46.729976}  (not concave)
Iteration 8:{space 3}log likelihood = {res:-46.723602}  (not concave)
Iteration 9:{space 3}log likelihood = {res:-46.716846}  (not concave)
Iteration 10:{space 2}log likelihood = {res:-46.702513}  (not concave)
Iteration 11:{space 2}log likelihood = {res:-46.698735}  (not concave)
Iteration 12:{space 2}log likelihood = {res:-46.691089}  (not concave)
Iteration 13:{space 2}log likelihood = {res:-46.684591}  (not concave)
Iteration 14:{space 2}log likelihood = {res:-46.675078}  (not concave)
Iteration 15:{space 2}log likelihood = {res:-46.658854}  (not concave)
Iteration 16:{space 2}log likelihood = {res:-46.482007}  (not concave)
Iteration 17:{space 2}log likelihood = {res:-46.117002}  (not concave)
Iteration 18:{space 2}log likelihood = {res: -46.01619}  (not concave)
Iteration 19:{space 2}log likelihood = {res:-45.709064}  (not concave)
Iteration 20:{space 2}log likelihood = {res:-45.526644}  (not concave)
Iteration 21:{space 2}log likelihood = {res:-45.306664}  
Iteration 22:{space 2}log likelihood = {res:-45.285105}  
Iteration 23:{space 2}log likelihood = {res:-45.165545}  
Iteration 24:{space 2}log likelihood = {res:-45.153161}  
Iteration 25:{space 2}log likelihood = {res:-45.152341}  
Iteration 26:{space 2}log likelihood = {res:-45.152292}  
Iteration 27:{space 2}log likelihood = {res:-45.152288}  
{res}
{txt}Extended interval regression{col 49}Number of obs{col 67}= {res}        32
{txt}{col 49}   Uncensored{col 67}= {res}        30
{txt}{col 49}   Left-censored{col 67}= {res}         0
{txt}{col 49}   Right-censored{col 67}= {res}         2
{txt}{col 49}   Interval-cens.{col 67}= {res}         0

{txt}{col 49}Wald chi2({res}2{txt}){col 67}= {res}  12212.91
{txt}Log likelihood = {res}-45.152288{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000

{txt}{hline 36}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 37}{c |}      Coef.{col 49}   Std. Err.{col 61}      z{col 69}   P>|z|{col 77}     [95% Con{col 90}f. Interval]
{hline 36}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 14}meta_analysis_planned {c |}
{space 31}Yes  {c |}{col 37}{res}{space 2}     1.69{col 49}{space 2}     0.28{col 60}{space 1}    6.04{col 69}{space 3} 0.00{col 77}{space 4}     1.14{col 90}{space 3}     2.24
{txt}{space 35} {c |}
{space 24}rec_vs_none {c |}
{space 33}H  {c |}{col 37}{res}{space 2}    -2.31{col 49}{space 2}     0.28{col 60}{space 1}   -8.25{col 69}{space 3} 0.00{col 77}{space 4}    -2.86{col 90}{space 3}    -1.76
{txt}{space 30}_cons {c |}{col 37}{res}{space 2}     6.05{col 49}{space 2}     0.27{col 60}{space 1}   22.15{col 69}{space 3} 0.00{col 77}{space 4}     5.52{col 90}{space 3}     6.59
{txt}{hline 36}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}rec_vs_none                         {txt}{c |}
{space 30}field {c |}
{space 27}Welfare  {c |}{col 37}{res}{space 2}    -1.25{col 49}{space 2}     0.21{col 60}{space 1}   -6.12{col 69}{space 3} 0.00{col 77}{space 4}    -1.66{col 90}{space 3}    -0.85
{txt}{space 35} {c |}
{space 23}prespecified {c |}
{space 31}Yes  {c |}{col 37}{res}{space 2}    -1.45{col 49}{space 2}     0.32{col 60}{space 1}   -4.53{col 69}{space 3} 0.00{col 77}{space 4}    -2.08{col 90}{space 3}    -0.82
{txt}{hline 36}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}/rec_vs_none                        {txt}{c |}
{space 31}cut1 {c |}{col 37}{res}{space 2}    -0.55{col 49}{space 2}     0.22{col 77}{space 4}    -0.99{col 90}{space 3}    -0.11
{txt}{hline 36}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 16}var(e.log_resource1){c |}{col 37}{res}{space 2}     0.98{col 49}{space 2}     0.25{col 77}{space 4}     0.59{col 90}{space 3}     1.62
{txt}{hline 36}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}corr(e.rec_vs_none,e.log_resource1){c |}{col 37}{res}{space 2}     1.00{col 49}{space 2}        .{col 60}{space 1}       .{col 69}{space 3}    .{col 77}{space 4}        .{col 90}{space 3}        .
{txt}{hline 36}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
(option {bf:mean} assumed; average structural function mean)
{res}{txt}(6 missing values generated)
{res}{txt}(9 missing values generated)

                   Shapiro-Wilk W test for normal data

    Variable {c |}        Obs{col 33}W{col 45}V{col 55}z       Prob>z
{hline 13}{c +}{hline 54}
    __000001 {c |} {res}        30    0.97112      0.918    -0.177    0.57022
{hline}
Analysis for: {ul:rec_vs_none} with respect to {ul:time}

         {txt}failure _d:  {res}completed
   {txt}analysis time _t:  {res}(completion-origin)/7
             {txt}origin:  {res}time commission

{txt}Iteration 0:{space 3}EE criterion = {res: 6.679e-16}  
Iteration 1:{space 3}EE criterion = {res: 7.891e-27}  
{res}
{txt}Survival treatment-effects estimation{col 49}Number of obs {col 67}= {res}        33
{txt:Estimator}{col 16}:{res: IPW regression adjustment}
{txt:Outcome model}{col 16}:{res: Weibull}
{txt:Treatment model}{col 16}:{res: logit}
{txt:Censoring model}{col 16}:{res: none}
{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}                   _t{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}ATE                   {txt}{c |}
{space 10}rec_vs_none {c |}
{space 12}(H vs G)  {c |}{col 23}{res}{space 2}     3.22{col 35}{space 2}     8.16{col 46}{space 1}    0.40{col 55}{space 3} 0.69{col 63}{space 4}   -12.77{col 76}{space 3}    19.22
{txt}{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}POmean                {txt}{c |}
{space 10}rec_vs_none {c |}
{space 19}G  {c |}{col 23}{res}{space 2}    30.89{col 35}{space 2}     4.13{col 46}{space 1}    7.48{col 55}{space 3} 0.00{col 63}{space 4}    22.79{col 76}{space 3}    38.98
{txt}{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}OME1                  {txt}{c |}
meta_analysis_planned {c |}
{space 17}Yes  {c |}{col 23}{res}{space 2}     0.53{col 35}{space 2}     0.28{col 46}{space 1}    1.88{col 55}{space 3} 0.06{col 63}{space 4}    -0.02{col 76}{space 3}     1.08
{txt}{space 16}_cons {c |}{col 23}{res}{space 2}     3.29{col 35}{space 2}     0.21{col 46}{space 1}   15.62{col 55}{space 3} 0.00{col 63}{space 4}     2.88{col 76}{space 3}     3.70
{txt}{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}OME1_lnshape          {txt}{c |}
{space 16}_cons {c |}{col 23}{res}{space 2}     0.57{col 35}{space 2}     0.18{col 46}{space 1}    3.11{col 55}{space 3} 0.00{col 63}{space 4}     0.21{col 76}{space 3}     0.92
{txt}{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}OME2                  {txt}{c |}
meta_analysis_planned {c |}
{space 17}Yes  {c |}{col 23}{res}{space 2}     1.69{col 35}{space 2}     0.23{col 46}{space 1}    7.48{col 55}{space 3} 0.00{col 63}{space 4}     1.25{col 76}{space 3}     2.13
{txt}{space 16}_cons {c |}{col 23}{res}{space 2}     2.59{col 35}{space 2}     0.10{col 46}{space 1}   26.38{col 55}{space 3} 0.00{col 63}{space 4}     2.40{col 76}{space 3}     2.78
{txt}{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}OME2_lnshape          {txt}{c |}
{space 16}_cons {c |}{col 23}{res}{space 2}     0.95{col 35}{space 2}     0.26{col 46}{space 1}    3.65{col 55}{space 3} 0.00{col 63}{space 4}     0.44{col 76}{space 3}     1.46
{txt}{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}TME2                  {txt}{c |}
{space 16}field {c |}
{space 13}Welfare  {c |}{col 23}{res}{space 2}    -2.47{col 35}{space 2}     1.16{col 46}{space 1}   -2.13{col 55}{space 3} 0.03{col 63}{space 4}    -4.74{col 76}{space 3}    -0.20
{txt}{space 21} {c |}
{space 9}prespecified {c |}
{space 17}Yes  {c |}{col 23}{res}{space 2}    -2.91{col 35}{space 2}     1.20{col 46}{space 1}   -2.42{col 55}{space 3} 0.02{col 63}{space 4}    -5.26{col 76}{space 3}    -0.56
{txt}{space 16}_cons {c |}{col 23}{res}{space 2}     2.42{col 35}{space 2}     1.38{col 46}{space 1}    1.75{col 55}{space 3} 0.08{col 63}{space 4}    -0.29{col 76}{space 3}     5.12
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{hline}
{res}Analysis for: {ul:rec_vs_nonrec} with respect to {ul:resource}

{txt}Fitting constant-only model:
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-29.748603}  
Iteration 1:{space 3}log likelihood = {res:-29.582194}  
Iteration 2:{space 3}log likelihood = {res:-29.582064}  
Iteration 3:{space 3}log likelihood = {res:-29.582064}  
{res}
{txt}Fitting full model:
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-28.049617}  
Iteration 1:{space 3}log likelihood = {res:-27.958835}  
Iteration 2:{space 3}log likelihood = {res:-27.958832}  
Iteration 3:{space 3}log likelihood = {res:-27.958832}  
{res}
{txt}Interval regression{col 49}Number of obs{col 67}= {res}        27
{txt}{col 49}   Uncensored{col 67}= {res}        24
{txt}{col 49}   Left-censored{col 67}= {res}         0
{txt}{col 49}   Right-censored{col 67}= {res}         3
{txt}{col 49}   Interval-cens.{col 67}= {res}         0

{txt}{col 49}LR chi2({res}2{txt}){col 67}= {res}      3.25
{txt}Log likelihood = {res}-27.958832{txt}{col 49}Prob > chi2{col 67}= {res}    0.1973

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}rec_vs_nonrec {c |}
{space 19}K  {c |}{col 23}{res}{space 2}     0.40{col 35}{space 2}     0.33{col 46}{space 1}    1.22{col 55}{space 3} 0.22{col 63}{space 4}    -0.24{col 76}{space 3}     1.05
{txt}{space 21} {c |}
meta_analysis_planned {c |}
{space 17}Yes  {c |}{col 23}{res}{space 2}     0.33{col 35}{space 2}     0.27{col 46}{space 1}    1.21{col 55}{space 3} 0.23{col 63}{space 4}    -0.20{col 76}{space 3}     0.86
{txt}{space 16}_cons {c |}{col 23}{res}{space 2}     6.31{col 35}{space 2}     0.20{col 46}{space 1}   31.63{col 55}{space 3} 0.00{col 63}{space 4}     5.91{col 76}{space 3}     6.70
{txt}{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
             /lnsigma {c |}{col 23}{res}{space 2}    -0.38{col 35}{space 2}     0.15{col 46}{space 1}   -2.55{col 55}{space 3} 0.01{col 63}{space 4}    -0.66{col 76}{space 3}    -0.09
{txt}{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
                sigma {c |}{col 23}{res}{space 2}     0.69{col 35}{space 2}     0.10{col 63}{space 4}     0.51{col 76}{space 3}     0.92
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
(option {bf:xb} assumed; fitted values)
(12 missing values generated)
(15 missing values generated)

                   Shapiro-Wilk W test for normal data

    Variable {c |}        Obs{col 33}W{col 45}V{col 55}z       Prob>z
{hline 13}{c +}{hline 54}
    __000003 {c |} {res}        24    0.96018      1.074     0.146    0.44214
{hline}
Analysis for: {ul:rec_vs_nonrec} with respect to {ul:time}

         {txt}failure _d:  {res}completed
   {txt}analysis time _t:  {res}(completion-origin)/7
             {txt}origin:  {res}time commission

{txt}Iteration 0:{space 3}EE criterion = {res: 2.696e-15}  
Iteration 1:{space 3}EE criterion = {res: 7.107e-27}  
{res}
{txt}Survival treatment-effects estimation{col 49}Number of obs {col 67}= {res}        27
{txt:Estimator}{col 16}:{res: IPW regression adjustment}
{txt:Outcome model}{col 16}:{res: Weibull}
{txt:Treatment model}{col 16}:{res: logit}
{txt:Censoring model}{col 16}:{res: none}
{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}                   _t{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}ATE                   {txt}{c |}
{space 8}rec_vs_nonrec {c |}
{space 12}(K vs J)  {c |}{col 23}{res}{space 2}    -3.93{col 35}{space 2}     8.06{col 46}{space 1}   -0.49{col 55}{space 3} 0.63{col 63}{space 4}   -19.73{col 76}{space 3}    11.87
{txt}{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}POmean                {txt}{c |}
{space 8}rec_vs_nonrec {c |}
{space 19}J  {c |}{col 23}{res}{space 2}    34.36{col 35}{space 2}     7.36{col 46}{space 1}    4.67{col 55}{space 3} 0.00{col 63}{space 4}    19.94{col 76}{space 3}    48.78
{txt}{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}OME1                  {txt}{c |}
meta_analysis_planned {c |}
{space 17}Yes  {c |}{col 23}{res}{space 2}     0.46{col 35}{space 2}     0.38{col 46}{space 1}    1.21{col 55}{space 3} 0.23{col 63}{space 4}    -0.28{col 76}{space 3}     1.20
{txt}{space 16}_cons {c |}{col 23}{res}{space 2}     3.38{col 35}{space 2}     0.20{col 46}{space 1}   17.27{col 55}{space 3} 0.00{col 63}{space 4}     3.00{col 76}{space 3}     3.76
{txt}{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}OME1_lnshape          {txt}{c |}
{space 16}_cons {c |}{col 23}{res}{space 2}     0.42{col 35}{space 2}     0.16{col 46}{space 1}    2.69{col 55}{space 3} 0.01{col 63}{space 4}     0.11{col 76}{space 3}     0.72
{txt}{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}OME2                  {txt}{c |}
meta_analysis_planned {c |}
{space 17}Yes  {c |}{col 23}{res}{space 2}     0.39{col 35}{space 2}     0.29{col 46}{space 1}    1.31{col 55}{space 3} 0.19{col 63}{space 4}    -0.19{col 76}{space 3}     0.96
{txt}{space 16}_cons {c |}{col 23}{res}{space 2}     3.32{col 35}{space 2}     0.21{col 46}{space 1}   15.74{col 55}{space 3} 0.00{col 63}{space 4}     2.90{col 76}{space 3}     3.73
{txt}{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}OME2_lnshape          {txt}{c |}
{space 16}_cons {c |}{col 23}{res}{space 2}     0.66{col 35}{space 2}     0.09{col 46}{space 1}    7.22{col 55}{space 3} 0.00{col 63}{space 4}     0.48{col 76}{space 3}     0.84
{txt}{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}TME2                  {txt}{c |}
{space 16}field {c |}
{space 13}Welfare  {c |}{col 23}{res}{space 2}    -2.53{col 35}{space 2}     1.19{col 46}{space 1}   -2.12{col 55}{space 3} 0.03{col 63}{space 4}    -4.87{col 76}{space 3}    -0.19
{txt}{space 21} {c |}
{space 9}prespecified {c |}
{space 17}Yes  {c |}{col 23}{res}{space 2}     0.18{col 35}{space 2}     1.27{col 46}{space 1}    0.14{col 55}{space 3} 0.89{col 63}{space 4}    -2.30{col 76}{space 3}     2.66
{txt}{space 16}_cons {c |}{col 23}{res}{space 2}    -0.33{col 35}{space 2}     1.22{col 46}{space 1}   -0.27{col 55}{space 3} 0.79{col 63}{space 4}    -2.71{col 76}{space 3}     2.05
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{hline}
{res}Analysis for: {ul:any_vs_none} with respect to {ul:resource}

{txt}Iteration 0:{space 3}log likelihood = {res:-59.556087}  (not concave)
Iteration 1:{space 3}log likelihood = {res: -57.25329}  
Iteration 2:{space 3}log likelihood = {res:-56.036343}  
Iteration 3:{space 3}log likelihood = {res:-55.802492}  
Iteration 4:{space 3}log likelihood = {res:-55.799069}  
Iteration 5:{space 3}log likelihood = {res:-55.799063}  
Iteration 6:{space 3}log likelihood = {res:-55.799063}  
{res}
{txt}Extended interval regression{col 49}Number of obs{col 67}= {res}        38
{txt}{col 49}   Uncensored{col 67}= {res}        35
{txt}{col 49}   Left-censored{col 67}= {res}         0
{txt}{col 49}   Right-censored{col 67}= {res}         3
{txt}{col 49}   Interval-cens.{col 67}= {res}         0

{txt}{col 49}Wald chi2({res}2{txt}){col 67}= {res}     32.82
{txt}Log likelihood = {res}-55.799063{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000

{txt}{hline 36}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 37}{c |}      Coef.{col 49}   Std. Err.{col 61}      z{col 69}   P>|z|{col 77}     [95% Con{col 90}f. Interval]
{hline 36}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 14}meta_analysis_planned {c |}
{space 31}Yes  {c |}{col 37}{res}{space 2}     0.90{col 49}{space 2}     0.33{col 60}{space 1}    2.73{col 69}{space 3} 0.01{col 77}{space 4}     0.25{col 90}{space 3}     1.55
{txt}{space 35} {c |}
{space 24}any_vs_none {c |}
{space 33}R  {c |}{col 37}{res}{space 2}    -2.49{col 49}{space 2}     0.44{col 60}{space 1}   -5.71{col 69}{space 3} 0.00{col 77}{space 4}    -3.34{col 90}{space 3}    -1.63
{txt}{space 30}_cons {c |}{col 37}{res}{space 2}     6.42{col 49}{space 2}     0.20{col 60}{space 1}   31.71{col 69}{space 3} 0.00{col 77}{space 4}     6.03{col 90}{space 3}     6.82
{txt}{hline 36}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}any_vs_none                         {txt}{c |}
{space 30}field {c |}
{space 27}Welfare  {c |}{col 37}{res}{space 2}    -0.46{col 49}{space 2}     0.44{col 60}{space 1}   -1.04{col 69}{space 3} 0.30{col 77}{space 4}    -1.32{col 90}{space 3}     0.40
{txt}{space 35} {c |}
{space 23}prespecified {c |}
{space 31}Yes  {c |}{col 37}{res}{space 2}    -1.92{col 49}{space 2}     0.41{col 60}{space 1}   -4.66{col 69}{space 3} 0.00{col 77}{space 4}    -2.73{col 90}{space 3}    -1.11
{txt}{hline 36}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}/any_vs_none                        {txt}{c |}
{space 31}cut1 {c |}{col 37}{res}{space 2}    -0.44{col 49}{space 2}     0.30{col 77}{space 4}    -1.03{col 90}{space 3}     0.15
{txt}{hline 36}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 16}var(e.log_resource1){c |}{col 37}{res}{space 2}     0.86{col 49}{space 2}     0.31{col 77}{space 4}     0.42{col 90}{space 3}     1.73
{txt}{hline 36}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}corr(e.any_vs_none,e.log_resource1){c |}{col 37}{res}{space 2}     0.94{col 49}{space 2}     0.11{col 60}{space 1}    8.78{col 69}{space 3} 0.00{col 77}{space 4}    -0.11{col 90}{space 3}     1.00
{txt}{hline 36}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
(option {bf:mean} assumed; average structural function mean)
{res}{txt}(4 missing values generated)

                   Shapiro-Wilk W test for normal data

    Variable {c |}        Obs{col 33}W{col 45}V{col 55}z       Prob>z
{hline 13}{c +}{hline 54}
    __000005 {c |} {res}        35    0.98620      0.493    -1.478    0.93023
{hline}
Analysis for: {ul:any_vs_none} with respect to {ul:time}

         {txt}failure _d:  {res}completed
   {txt}analysis time _t:  {res}(completion-origin)/7
             {txt}origin:  {res}time commission

{txt}Iteration 0:{space 3}EE criterion = {res: 2.878e-16}  
Iteration 1:{space 3}EE criterion = {res: 3.890e-28}  
{res}
{txt}Survival treatment-effects estimation{col 49}Number of obs {col 67}= {res}        39
{txt:Estimator}{col 16}:{res: IPW regression adjustment}
{txt:Outcome model}{col 16}:{res: Weibull}
{txt:Treatment model}{col 16}:{res: logit}
{txt:Censoring model}{col 16}:{res: none}
{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}                   _t{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}ATE                   {txt}{c |}
{space 10}any_vs_none {c |}
{space 12}(R vs Q)  {c |}{col 23}{res}{space 2}     3.28{col 35}{space 2}     8.71{col 46}{space 1}    0.38{col 55}{space 3} 0.71{col 63}{space 4}   -13.79{col 76}{space 3}    20.36
{txt}{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}POmean                {txt}{c |}
{space 10}any_vs_none {c |}
{space 19}Q  {c |}{col 23}{res}{space 2}    32.36{col 35}{space 2}     4.53{col 46}{space 1}    7.14{col 55}{space 3} 0.00{col 63}{space 4}    23.48{col 76}{space 3}    41.23
{txt}{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}OME1                  {txt}{c |}
meta_analysis_planned {c |}
{space 17}Yes  {c |}{col 23}{res}{space 2}     0.67{col 35}{space 2}     0.26{col 46}{space 1}    2.60{col 55}{space 3} 0.01{col 63}{space 4}     0.17{col 76}{space 3}     1.18
{txt}{space 16}_cons {c |}{col 23}{res}{space 2}     3.22{col 35}{space 2}     0.17{col 46}{space 1}   19.22{col 55}{space 3} 0.00{col 63}{space 4}     2.89{col 76}{space 3}     3.55
{txt}{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}OME1_lnshape          {txt}{c |}
{space 16}_cons {c |}{col 23}{res}{space 2}     0.52{col 35}{space 2}     0.11{col 46}{space 1}    4.80{col 55}{space 3} 0.00{col 63}{space 4}     0.31{col 76}{space 3}     0.73
{txt}{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}OME2                  {txt}{c |}
meta_analysis_planned {c |}
{space 17}Yes  {c |}{col 23}{res}{space 2}     1.69{col 35}{space 2}     0.24{col 46}{space 1}    7.16{col 55}{space 3} 0.00{col 63}{space 4}     1.22{col 76}{space 3}     2.15
{txt}{space 16}_cons {c |}{col 23}{res}{space 2}     2.59{col 35}{space 2}     0.10{col 46}{space 1}   26.22{col 55}{space 3} 0.00{col 63}{space 4}     2.39{col 76}{space 3}     2.78
{txt}{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}OME2_lnshape          {txt}{c |}
{space 16}_cons {c |}{col 23}{res}{space 2}     0.89{col 35}{space 2}     0.27{col 46}{space 1}    3.34{col 55}{space 3} 0.00{col 63}{space 4}     0.37{col 76}{space 3}     1.42
{txt}{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}TME2                  {txt}{c |}
{space 16}field {c |}
{space 13}Welfare  {c |}{col 23}{res}{space 2}    -1.58{col 35}{space 2}     0.85{col 46}{space 1}   -1.87{col 55}{space 3} 0.06{col 63}{space 4}    -3.24{col 76}{space 3}     0.08
{txt}{space 21} {c |}
{space 9}prespecified {c |}
{space 17}Yes  {c |}{col 23}{res}{space 2}    -2.53{col 35}{space 2}     0.89{col 46}{space 1}   -2.84{col 55}{space 3} 0.00{col 63}{space 4}    -4.27{col 76}{space 3}    -0.78
{txt}{space 16}_cons {c |}{col 23}{res}{space 2}     1.40{col 35}{space 2}     0.93{col 46}{space 1}    1.50{col 55}{space 3} 0.13{col 63}{space 4}    -0.42{col 76}{space 3}     3.23
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
{txt}end of do-file

{com}. 
. // Make figures
. do figures/figures
{txt}
{com}. version 16.1
{txt}
{com}. set graphics off
{txt}
{com}. 
. // Specify options for the KM plots.
. local opts        ci ci1opts(fcolor(navy%20)) ci2opts(fcolor(maroon%20)) // Translucent CI bands.
{txt}
{com}. local opts `opts' risktable(, title("Incomplete Reviews"))               // Title.
{txt}
{com}. local opts `opts' risktable(, rowtitle("Blinded 1") group(1))            // TODO: Specify the rowtitle after unblinding.
{txt}
{com}. local opts `opts' risktable(, rowtitle("Blinded 2") group(2))            // TODO: Specify the rowtitle after unblinding.
{txt}
{com}. local opts `opts' censored(number)                                       // Indicate number of censorings.
{txt}
{com}. local opts `opts' xtitle("Weeks After Review Commission")                // X-axis title.
{txt}
{com}. local opts `opts' ylabel(0 "0%" 0.25 "25%" 0.5 "50%" 0.75 "75%" 1 "100%", angle(0) nogrid) // Y-axis ticks etc.
{txt}
{com}. local opts `opts' ytitle("Completed Reviews (95% CI)")
{txt}
{com}. 
. // Make a Kaplan-Meier plot for each comparison.
. foreach comparison of global comparisons {c -(}  
{txt}  2{com}.   // Get the name of the comparison for the filename and figure title.
.   local comparison_name : variable label `comparison'
{txt}  3{com}. 
.   // Make the figure.
.   sts graph , failure by(`comparison') `opts' title("")
{txt}  4{com}.   
.   // Save the figure in the required formats.
.   foreach format in png pdf {c -(} // TODO: Add TIFF with compression via sips.
{txt}  5{com}.     local width ""
{txt}  6{com}.     if "`format'" == "png" local width width(3000)
{txt}  7{com}.     local filename "products/Time-to-completion for `comparison_name'.`format'"
{txt}  8{com}.     graph export "`filename'" , `width' replace
{txt}  9{com}.   {c )-}
{txt} 10{com}. {c )-}

         {txt}failure _d:  {res}completed
   {txt}analysis time _t:  {res}(completion-origin)/7
             {txt}origin:  {res}time commission
{txt}(file /Users/cjr/Repos/fhi.ml-resource-time.2023/products/Time-to-completion for Recommended vs No ML Use.png written in PNG format)
(file products/Time-to-completion for Recommended vs No ML Use.pdf written in PDF format)

         failure _d:  {res}completed
   {txt}analysis time _t:  {res}(completion-origin)/7
             {txt}origin:  {res}time commission
{txt}(file /Users/cjr/Repos/fhi.ml-resource-time.2023/products/Time-to-completion for Recommended vs Non-recommended ML Use.png written in PNG format)
(file products/Time-to-completion for Recommended vs Non-recommended ML Use.pdf written in PDF format)

         failure _d:  {res}completed
   {txt}analysis time _t:  {res}(completion-origin)/7
             {txt}origin:  {res}time commission
{txt}(file /Users/cjr/Repos/fhi.ml-resource-time.2023/products/Time-to-completion for Any vs No ML Use.png written in PNG format)
(file products/Time-to-completion for Any vs No ML Use.pdf written in PDF format)

{com}. 
. set graphics on
{txt}
{com}. 
{txt}end of do-file

{com}. 
. // Obtain the git revision hash, which is used in the reports.
. tempfile git_revision_filename
{txt}
{com}. tempname revision_file
{txt}
{com}. shell git rev-parse --short HEAD > "`git_revision_filename'"
{txt}

{com}. file open `revision_file' using `git_revision_filename', read text
{txt}
{com}. file read `revision_file' line
{txt}
{com}. global git_revision = "`macval(line)'"
{txt}
{com}. 
. // Make the report.
. do reports/report
{txt}
{com}. version 16.1
{txt}
{com}. 
. // Some locals to make this file a little more readable.
. local heading putdocx paragraph, style(Heading1)
{txt}
{com}. local subhead putdocx paragraph, style(Heading2)
{txt}
{com}. local newpara putdocx textblock begin, halign(both)
{txt}
{com}. local putdocx textblock end putdocx textblock end
{txt}
{com}. 
. local p_fmt  %5.2f // Format used for P-values.
{txt}
{com}. local e_fmt  %5.2f // Format used for estimates.
{txt}
{com}. local pc_fmt %8.1f // Format used for percentages.
{txt}
{com}. 
. // Start the document.
. putdocx begin
{res}{txt}
{com}. 
. // Title.
. putdocx paragraph, style(Title)
{res}{txt}
{com}. putdocx text ("The effect of machine learning tools for evidence synthesis on resource use and time-to-completion")
{res}{txt}
{com}. 
. // Author and revision information.
. `newpara'
{res}{txt}
{com}. `newpara'
{res}{txt}
{com}. 
. // Methods section
. `heading'
{res}{txt}
{com}. putdocx text ("Methods")
{res}{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. `heading'
{res}{txt}
{com}. putdocx text ("Protocol Deviations")
{res}{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. // Start a new page.
. putdocx pagebreak
{res}{txt}
{com}. 
. // Results section
. `heading'
{res}{txt}
{com}. putdocx text ("Results")
{res}{txt}
{com}. 
. // Insert the table of results.
. results_table
{res}{txt}1 2
  {res}21

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
log_resour~1 {c |}{res}         19    6.344384    .6060508   5.192957   7.273787
  12

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
log_resour~1 {c |}{res}         11    4.942194    1.233002   3.218876   6.958448
{txt}(results {stata estimates replay rec_vs_none_resource:rec_vs_none_resource} are active now)

{p 0 7}{space 1}{text:( 1)}{space 1} {res}[log_resource1]2.rec_vs_none = 0{p_end}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}     exp(b){col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}(1) {c |}{col 14}{res}{space 2}     0.10{col 26}{space 2}     0.03{col 37}{space 1}   -8.25{col 46}{space 3} 0.00{col 54}{space 4}     0.06{col 67}{space 3}     0.17
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}1 2
  {res}21

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
log_resour~1 {c |}{res}         19    6.344384    .6060508   5.192957   7.273787
  6

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
log_resour~1 {c |}{res}          5    6.789035    .8300506   5.828946   7.728416
{txt}(results {stata estimates replay rec_vs_nonrec_resource:rec_vs_nonrec_resource} are active now)

{p 0 7}{space 1}{text:( 1)}{space 1} {res}[model]2.rec_vs_nonrec = 0{p_end}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}     exp(b){col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}(1) {c |}{col 14}{res}{space 2}     1.49{col 26}{space 2}     0.49{col 37}{space 1}    1.22{col 46}{space 3} 0.22{col 54}{space 4}     0.78{col 67}{space 3}     2.85
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}1 2
  {res}27

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
log_resour~1 {c |}{res}         24     6.43702    .6643046   5.192957   7.728416
  12

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
log_resour~1 {c |}{res}         11    4.942194    1.233002   3.218876   6.958448
{txt}(results {stata estimates replay any_vs_none_resource:any_vs_none_resource} are active now)

{p 0 7}{space 1}{text:( 1)}{space 1} {res}[log_resource1]2.any_vs_none = 0{p_end}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}     exp(b){col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}(1) {c |}{col 14}{res}{space 2}     0.08{col 26}{space 2}     0.04{col 37}{space 1}   -5.71{col 46}{space 3} 0.00{col 54}{space 4}     0.04{col 67}{space 3}     0.20
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}1 2
  {res}21

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}_t {c |}{res}         19    27.43609    15.02005   7.142857         60
  12

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}_t {c |}{res}         12     28.2381     31.0725   4.857143   101.8571
{txt}(results {stata estimates replay rec_vs_none_time:rec_vs_none_time} are active now)

       _nl_1:  {res}log(_b[ATE:r2vs1.rec_vs_none] + _b[POmean:1.rec_vs_none]) - log(_b[POmean:1.rec_vs_none])

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          _t{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_nl_1 {c |}{col 14}{res}{space 2}     0.10{col 26}{space 2}     0.24{col 37}{space 1}    0.41{col 46}{space 3} 0.68{col 54}{space 4}    -0.38{col 67}{space 3}     0.58
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{p 0 7}{space 1}{text:( 1)}{space 1} {res}_nl_1 = 0{p_end}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          _t{col 14}{c |}     exp(b){col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}(1) {c |}{col 14}{res}{space 2}     1.10{col 26}{space 2}     0.27{col 37}{space 1}    0.41{col 46}{space 3} 0.68{col 54}{space 4}     0.69{col 67}{space 3}     1.78
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}1 2
  {res}21

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}_t {c |}{res}         19    27.43609    15.02005   7.142857         60
  6

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}_t {c |}{res}          5    36.22857    26.41073   15.57143   81.42857
{txt}(results {stata estimates replay rec_vs_nonrec_time:rec_vs_nonrec_time} are active now)

       _nl_1:  {res}log(_b[ATE:r2vs1.rec_vs_nonrec] + _b[POmean:1.rec_vs_nonrec]) - log(_b[POmean:1.rec_vs_nonrec])

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          _t{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_nl_1 {c |}{col 14}{res}{space 2}    -0.12{col 26}{space 2}     0.24{col 37}{space 1}   -0.50{col 46}{space 3} 0.62{col 54}{space 4}    -0.60{col 67}{space 3}     0.35
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{p 0 7}{space 1}{text:( 1)}{space 1} {res}_nl_1 = 0{p_end}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          _t{col 14}{c |}     exp(b){col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}(1) {c |}{col 14}{res}{space 2}     0.89{col 26}{space 2}     0.21{col 37}{space 1}   -0.50{col 46}{space 3} 0.62{col 54}{space 4}     0.55{col 67}{space 3}     1.42
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}1 2
  {res}27

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}_t {c |}{res}         24    29.26786    17.64006   7.142857   81.42857
  12

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}_t {c |}{res}         12     28.2381     31.0725   4.857143   101.8571
{txt}(results {stata estimates replay any_vs_none_time:any_vs_none_time} are active now)

       _nl_1:  {res}log(_b[ATE:r2vs1.any_vs_none] + _b[POmean:1.any_vs_none]) - log(_b[POmean:1.any_vs_none])

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          _t{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_nl_1 {c |}{col 14}{res}{space 2}     0.10{col 26}{space 2}     0.25{col 37}{space 1}    0.39{col 46}{space 3} 0.70{col 54}{space 4}    -0.39{col 67}{space 3}     0.58
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{p 0 7}{space 1}{text:( 1)}{space 1} {res}_nl_1 = 0{p_end}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          _t{col 14}{c |}     exp(b){col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}(1) {c |}{col 14}{res}{space 2}     1.10{col 26}{space 2}     0.27{col 37}{space 1}    0.39{col 46}{space 3} 0.70{col 54}{space 4}     0.68{col 67}{space 3}     1.79
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. // Start a new page.
. putdocx pagebreak
{res}{txt}
{com}. 
. // Insert the Kaplan-Meier plots.
. foreach comparison of global comparisons {c -(}
{txt}  2{com}.   local comparison_name : variable label `comparison'
{txt}  3{com}.   local title "Kaplan-Meier estimates for `comparison_name'"
{txt}  4{com}. 
.   `subhead'
{txt}  5{com}.   putdocx text ("`title'")
{txt}  6{com}.   putdocx image "products/Time-to-completion for `comparison_name'.png", linebreak
{txt}  7{com}. {c )-}
{res}{txt}
{com}. 
. `heading'
{res}{txt}
{com}. putdocx text ("Appendix — Full Regression Results")
{res}{txt}
{com}. 
. foreach comparison of global comparisons {c -(}
{txt}  2{com}.   foreach outcome of global outcomes {c -(}
{txt}  3{com}.     `subhead'
{txt}  4{com}.     putdocx text ("Regression results for `comparison' with respect to `outcome'")
{txt}  5{com}. 
.     estimates restore `comparison'_`outcome'
{txt}  6{com}.     estimates replay `comparison'_`outcome'
{txt}  7{com}.     putdocx table `comparison'_`outcome' = etable
{txt}  8{com}.   {c )-}
{txt}  9{com}. {c )-}
{res}{txt}(results {stata estimates replay rec_vs_none_resource:rec_vs_none_resource} are active now)

{hline}
{p 0 8}Model {hi:rec_vs_none_resource}{p_end}
{hline}

Extended interval regression{col 49}Number of obs{col 67}= {res}        32
{txt}{col 49}   Uncensored{col 67}= {res}        30
{txt}{col 49}   Left-censored{col 67}= {res}         0
{txt}{col 49}   Right-censored{col 67}= {res}         2
{txt}{col 49}   Interval-cens.{col 67}= {res}         0

{txt}{col 49}Wald chi2({res}2{txt}){col 67}= {res}  12212.91
{txt}Log likelihood = {res}-45.152288{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000

{txt}{hline 36}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 37}{c |}      Coef.{col 49}   Std. Err.{col 61}      z{col 69}   P>|z|{col 77}     [95% Con{col 90}f. Interval]
{hline 36}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 14}meta_analysis_planned {c |}
{space 31}Yes  {c |}{col 37}{res}{space 2}     1.69{col 49}{space 2}     0.28{col 60}{space 1}    6.04{col 69}{space 3} 0.00{col 77}{space 4}     1.14{col 90}{space 3}     2.24
{txt}{space 35} {c |}
{space 24}rec_vs_none {c |}
{space 33}H  {c |}{col 37}{res}{space 2}    -2.31{col 49}{space 2}     0.28{col 60}{space 1}   -8.25{col 69}{space 3} 0.00{col 77}{space 4}    -2.86{col 90}{space 3}    -1.76
{txt}{space 30}_cons {c |}{col 37}{res}{space 2}     6.05{col 49}{space 2}     0.27{col 60}{space 1}   22.15{col 69}{space 3} 0.00{col 77}{space 4}     5.52{col 90}{space 3}     6.59
{txt}{hline 36}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}rec_vs_none                         {txt}{c |}
{space 30}field {c |}
{space 27}Welfare  {c |}{col 37}{res}{space 2}    -1.25{col 49}{space 2}     0.21{col 60}{space 1}   -6.12{col 69}{space 3} 0.00{col 77}{space 4}    -1.66{col 90}{space 3}    -0.85
{txt}{space 35} {c |}
{space 23}prespecified {c |}
{space 31}Yes  {c |}{col 37}{res}{space 2}    -1.45{col 49}{space 2}     0.32{col 60}{space 1}   -4.53{col 69}{space 3} 0.00{col 77}{space 4}    -2.08{col 90}{space 3}    -0.82
{txt}{hline 36}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}/rec_vs_none                        {txt}{c |}
{space 31}cut1 {c |}{col 37}{res}{space 2}    -0.55{col 49}{space 2}     0.22{col 77}{space 4}    -0.99{col 90}{space 3}    -0.11
{txt}{hline 36}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 16}var(e.log_resource1){c |}{col 37}{res}{space 2}     0.98{col 49}{space 2}     0.25{col 77}{space 4}     0.59{col 90}{space 3}     1.62
{txt}{hline 36}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}corr(e.rec_vs_none,e.log_resource1){c |}{col 37}{res}{space 2}     1.00{col 49}{space 2}        .{col 60}{space 1}       .{col 69}{space 3}    .{col 77}{space 4}        .{col 90}{space 3}        .
{txt}{hline 36}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(results {stata estimates replay rec_vs_none_time:rec_vs_none_time} are active now)

{hline}
{p 0 8}Model {hi:rec_vs_none_time}{p_end}
{hline}

Survival treatment-effects estimation{col 49}Number of obs {col 67}= {res}        33
{txt:Estimator}{col 16}:{res: IPW regression adjustment}
{txt:Outcome model}{col 16}:{res: Weibull}
{txt:Treatment model}{col 16}:{res: logit}
{txt:Censoring model}{col 16}:{res: none}
{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}                   _t{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}ATE                   {txt}{c |}
{space 10}rec_vs_none {c |}
{space 12}(H vs G)  {c |}{col 23}{res}{space 2}     3.22{col 35}{space 2}     8.16{col 46}{space 1}    0.40{col 55}{space 3} 0.69{col 63}{space 4}   -12.77{col 76}{space 3}    19.22
{txt}{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}POmean                {txt}{c |}
{space 10}rec_vs_none {c |}
{space 19}G  {c |}{col 23}{res}{space 2}    30.89{col 35}{space 2}     4.13{col 46}{space 1}    7.48{col 55}{space 3} 0.00{col 63}{space 4}    22.79{col 76}{space 3}    38.98
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(results {stata estimates replay rec_vs_nonrec_resource:rec_vs_nonrec_resource} are active now)

{hline}
{p 0 8}Model {hi:rec_vs_nonrec_resource}{p_end}
{hline}

Interval regression{col 49}Number of obs{col 67}= {res}        27
{txt}{col 49}   Uncensored{col 67}= {res}        24
{txt}{col 49}   Left-censored{col 67}= {res}         0
{txt}{col 49}   Right-censored{col 67}= {res}         3
{txt}{col 49}   Interval-cens.{col 67}= {res}         0

{txt}{col 49}LR chi2({res}2{txt}){col 67}= {res}      3.25
{txt}Log likelihood = {res}-27.958832{txt}{col 49}Prob > chi2{col 67}= {res}    0.1973

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}rec_vs_nonrec {c |}
{space 19}K  {c |}{col 23}{res}{space 2}     0.40{col 35}{space 2}     0.33{col 46}{space 1}    1.22{col 55}{space 3} 0.22{col 63}{space 4}    -0.24{col 76}{space 3}     1.05
{txt}{space 21} {c |}
meta_analysis_planned {c |}
{space 17}Yes  {c |}{col 23}{res}{space 2}     0.33{col 35}{space 2}     0.27{col 46}{space 1}    1.21{col 55}{space 3} 0.23{col 63}{space 4}    -0.20{col 76}{space 3}     0.86
{txt}{space 16}_cons {c |}{col 23}{res}{space 2}     6.31{col 35}{space 2}     0.20{col 46}{space 1}   31.63{col 55}{space 3} 0.00{col 63}{space 4}     5.91{col 76}{space 3}     6.70
{txt}{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
             /lnsigma {c |}{col 23}{res}{space 2}    -0.38{col 35}{space 2}     0.15{col 46}{space 1}   -2.55{col 55}{space 3} 0.01{col 63}{space 4}    -0.66{col 76}{space 3}    -0.09
{txt}{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
                sigma {c |}{col 23}{res}{space 2}     0.69{col 35}{space 2}     0.10{col 63}{space 4}     0.51{col 76}{space 3}     0.92
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(results {stata estimates replay rec_vs_nonrec_time:rec_vs_nonrec_time} are active now)

{hline}
{p 0 8}Model {hi:rec_vs_nonrec_time}{p_end}
{hline}

Survival treatment-effects estimation{col 49}Number of obs {col 67}= {res}        27
{txt:Estimator}{col 16}:{res: IPW regression adjustment}
{txt:Outcome model}{col 16}:{res: Weibull}
{txt:Treatment model}{col 16}:{res: logit}
{txt:Censoring model}{col 16}:{res: none}
{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}                   _t{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}ATE                   {txt}{c |}
{space 8}rec_vs_nonrec {c |}
{space 12}(K vs J)  {c |}{col 23}{res}{space 2}    -3.93{col 35}{space 2}     8.06{col 46}{space 1}   -0.49{col 55}{space 3} 0.63{col 63}{space 4}   -19.73{col 76}{space 3}    11.87
{txt}{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}POmean                {txt}{c |}
{space 8}rec_vs_nonrec {c |}
{space 19}J  {c |}{col 23}{res}{space 2}    34.36{col 35}{space 2}     7.36{col 46}{space 1}    4.67{col 55}{space 3} 0.00{col 63}{space 4}    19.94{col 76}{space 3}    48.78
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(results {stata estimates replay any_vs_none_resource:any_vs_none_resource} are active now)

{hline}
{p 0 8}Model {hi:any_vs_none_resource}{p_end}
{hline}

Extended interval regression{col 49}Number of obs{col 67}= {res}        38
{txt}{col 49}   Uncensored{col 67}= {res}        35
{txt}{col 49}   Left-censored{col 67}= {res}         0
{txt}{col 49}   Right-censored{col 67}= {res}         3
{txt}{col 49}   Interval-cens.{col 67}= {res}         0

{txt}{col 49}Wald chi2({res}2{txt}){col 67}= {res}     32.82
{txt}Log likelihood = {res}-55.799063{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000

{txt}{hline 36}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 37}{c |}      Coef.{col 49}   Std. Err.{col 61}      z{col 69}   P>|z|{col 77}     [95% Con{col 90}f. Interval]
{hline 36}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 14}meta_analysis_planned {c |}
{space 31}Yes  {c |}{col 37}{res}{space 2}     0.90{col 49}{space 2}     0.33{col 60}{space 1}    2.73{col 69}{space 3} 0.01{col 77}{space 4}     0.25{col 90}{space 3}     1.55
{txt}{space 35} {c |}
{space 24}any_vs_none {c |}
{space 33}R  {c |}{col 37}{res}{space 2}    -2.49{col 49}{space 2}     0.44{col 60}{space 1}   -5.71{col 69}{space 3} 0.00{col 77}{space 4}    -3.34{col 90}{space 3}    -1.63
{txt}{space 30}_cons {c |}{col 37}{res}{space 2}     6.42{col 49}{space 2}     0.20{col 60}{space 1}   31.71{col 69}{space 3} 0.00{col 77}{space 4}     6.03{col 90}{space 3}     6.82
{txt}{hline 36}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}any_vs_none                         {txt}{c |}
{space 30}field {c |}
{space 27}Welfare  {c |}{col 37}{res}{space 2}    -0.46{col 49}{space 2}     0.44{col 60}{space 1}   -1.04{col 69}{space 3} 0.30{col 77}{space 4}    -1.32{col 90}{space 3}     0.40
{txt}{space 35} {c |}
{space 23}prespecified {c |}
{space 31}Yes  {c |}{col 37}{res}{space 2}    -1.92{col 49}{space 2}     0.41{col 60}{space 1}   -4.66{col 69}{space 3} 0.00{col 77}{space 4}    -2.73{col 90}{space 3}    -1.11
{txt}{hline 36}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}/any_vs_none                        {txt}{c |}
{space 31}cut1 {c |}{col 37}{res}{space 2}    -0.44{col 49}{space 2}     0.30{col 77}{space 4}    -1.03{col 90}{space 3}     0.15
{txt}{hline 36}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 16}var(e.log_resource1){c |}{col 37}{res}{space 2}     0.86{col 49}{space 2}     0.31{col 77}{space 4}     0.42{col 90}{space 3}     1.73
{txt}{hline 36}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}corr(e.any_vs_none,e.log_resource1){c |}{col 37}{res}{space 2}     0.94{col 49}{space 2}     0.11{col 60}{space 1}    8.78{col 69}{space 3} 0.00{col 77}{space 4}    -0.11{col 90}{space 3}     1.00
{txt}{hline 36}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(results {stata estimates replay any_vs_none_time:any_vs_none_time} are active now)

{hline}
{p 0 8}Model {hi:any_vs_none_time}{p_end}
{hline}

Survival treatment-effects estimation{col 49}Number of obs {col 67}= {res}        39
{txt:Estimator}{col 16}:{res: IPW regression adjustment}
{txt:Outcome model}{col 16}:{res: Weibull}
{txt:Treatment model}{col 16}:{res: logit}
{txt:Censoring model}{col 16}:{res: none}
{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}                   _t{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}ATE                   {txt}{c |}
{space 10}any_vs_none {c |}
{space 12}(R vs Q)  {c |}{col 23}{res}{space 2}     3.28{col 35}{space 2}     8.71{col 46}{space 1}    0.38{col 55}{space 3} 0.71{col 63}{space 4}   -13.79{col 76}{space 3}    20.36
{txt}{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}POmean                {txt}{c |}
{space 10}any_vs_none {c |}
{space 19}Q  {c |}{col 23}{res}{space 2}    32.36{col 35}{space 2}     4.53{col 46}{space 1}    7.14{col 55}{space 3} 0.00{col 63}{space 4}    23.48{col 76}{space 3}    41.23
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. // Save the report to the specified filename.
. putdocx save "${c -(}report_filename{c )-}", replace
{res}successfully replaced {browse "/Users/cjr/Repos/fhi.ml-resource-time.2023/products/ml-resource-time-report.docx":"/Users/cjr/Repos/fhi.ml-resource-time.2023/products/ml-resource-time-report.docx"}
{txt}
{com}. 
{txt}end of do-file

{com}. 
{txt}end of do-file

{com}. 