{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}ML noML
       {txt}log:  {res}/Users/cjr/Repos/fhi.ml-resource-time.2023/products/log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 5 Jun 2023, 13:02:37
{txt}
{com}. 
. // Set up globals.
. do globals/globals
{txt}
{com}. version 16.1
{txt}
{com}. 
. global data_file  "data/raw/Final data sheet_31012023_jm.xlsx"
{txt}
{com}. global sheet_name "Data Extraction Form"
{txt}
{com}. global cellrange  A1:BE40
{txt}
{com}. global signature           "39:57(80915):1037905700:239166213" // Signature of raw data.
{txt}
{com}. global processed_signature "39:25(49135):120443126:1133946948" // Signature of processed data.
{txt}
{com}. 
. global exported_data_file "products/resource-time.dta"
{txt}
{com}. 
. global random_seed 1234
{txt}
{com}. 
. global p_threshold 0.0001
{txt}
{com}. 
. global report_filename "products/ml-resource-time-report.docx"
{txt}
{com}. 
. // Define the comparisons specified in the protocol published in the journal.
. global comparisons rec_vs_none rec_vs_nonrec any_vs_none 
{txt}
{com}. 
. // Define the outcomes.
. global outcomes resource time
{txt}
{com}. 
. // Define the outcome variables.
. global resource_outcome log_resource1 log_resource2
{txt}
{com}. // Note: No need to specify outcomes for stset data.
. 
. // Define fixed effect covariate.
. global adj_var i.meta_analysis_planned
{txt}
{com}. 
. // Specify the model for endogeneous treatment assignment.
. global endo_vars i.field i.prespecified
{txt}
{com}. 
{txt}end of do-file

{com}. do globals/models
{txt}
{com}. version 16.1
{txt}
{com}. 
. // Specify the time use models.
. foreach comparison of global comparisons {c -(}
{txt}  2{com}.   global `comparison'_time_model     stteffects ipwra (${c -(}adj_var{c )-}) (`comparison' ${c -(}endo_vars{c )-}) , aequations
{txt}  3{com}. {c )-}
{txt}
{com}. 
. // Specify the resource use models.
. // We cannot use both variables to predict treatment in these analyses, and using the wrong one leads to nonsensical results (very large SEs on the treatment predictions).
. global rec_vs_none_resource_model   eintreg ${c -(}resource_outcome{c )-} ${c -(}adj_var{c )-} , entreat(rec_vs_none   = i.field ,        nointeract)
{txt}
{com}. global rec_vs_nonrec_resource_model eintreg ${c -(}resource_outcome{c )-} ${c -(}adj_var{c )-} , entreat(rec_vs_nonrec = i.prespecified , nointeract)
{txt}
{com}. global any_vs_none_resource_model   eintreg ${c -(}resource_outcome{c )-} ${c -(}adj_var{c )-} , entreat(any_vs_none   = i.field ,        nointeract)
{txt}
{com}. 
{txt}end of do-file

{com}. 
. // Set up Stata.
. do setup/setup
{txt}
{com}. version 16.1
{txt}
{com}. 
. // Set the random number generator seed.
. set rng  mt64s
{txt}
{com}. set seed ${c -(}random_seed{c )-}
{txt}
{com}. set rngstream 1
{txt}
{com}. 
. // Set up Stata's path to use the "packages" directory for add-on packages.
. net set ado "./packages"
{txt}
{com}. sysdir set PERSONAL "./packages"
{txt}
{com}. 
. // Specify formats.
. set cformat %9.2f
{txt}
{com}. set pformat %5.2f
{txt}
{com}. set sformat %8.2f
{txt}
{com}. 
. // Set the graphics scheme.
. set scheme white_background
{txt}
{com}. 
{txt}end of do-file

{com}. 
. // Import, process the data.
. do data/data
{txt}
{com}. version 16.1
{txt}
{com}. 
. // Only import and process the data if necessary.
. if fileexists("${c -(}exported_data_file{c )-}") {c -(}
.   disp "{c -(}hline{c )-}"
{res}{hline}
{com}.   disp as result "Using existing processed data"
{res}Using existing processed data
{com}.   exit

{txt}end of do-file

{com}. 
. // Clear the data and then use the processed data.
. clear
{txt}
{com}. do data/use
{txt}
{com}. version 16.1
{txt}
{com}. 
. use ${c -(}exported_data_file{c )-}
{txt}
{com}. datasignature
  {res}39:25(49135):120443126:1133946948
{txt}
{com}. assert r(datasignature) == "${c -(}processed_signature{c )-}"
{txt}
{com}. 
. // stset the data.
. stset completion , failure(completed) origin(time commission) scale(7 /*days*/)

     {txt}failure event:  {res}completed != 0 & completed < .
{txt}obs. time interval:  {res}(origin, completion]
{txt} exit on or before:  {res}failure
    {txt}t for analysis:  {res}(time-origin)/7
            {txt}origin:  {res}time commission

{txt}{hline 78}
{res}         39{txt}  total observations
{res}          1{txt}  observation ends on or before enter()
{hline 78}
{res}         38{txt}  observations remaining, representing
{res}         35{txt}  failures in single-record/single-failure data
{res}  1,211.571{txt}  total analysis time at risk and under observation
                                                at risk from t = {res}        0
                                     {txt}earliest observed entry t = {res}        0
                                          {txt}last observed exit t = {res} 102.1429
{txt}
{com}. 
{txt}end of do-file

{com}. 
. // Do estimation.
. do estimation/estimate
{txt}
{com}. version 16.1
{txt}
{com}. 
. // Perform estimation.
. foreach comparison of global comparisons {c -(}
{txt}  2{com}.   foreach outcome of global outcomes {c -(}
{txt}  3{com}.     disp "{c -(}hline{c )-}"
{txt}  4{com}.     disp as result "Analysis for: {c -(}ul:`comparison'{c )-} with respect to {c -(}ul:`outcome'{c )-}"
{txt}  5{com}. 
.     // Perform estimation and store the estimates.
.     ${c -(}`comparison'_`outcome'_model{c )-}
{txt}  6{com}.     assert e(converged)
{txt}  7{com}.     estimates store `comparison'_`outcome'
{txt}  8{com}. 
.     // Compute and test residuals for normality for eintreg.
.     if regexm("`e(cmd)'", "intreg") {c -(} // Match eintreg and intreg.
{txt}  9{com}.       tempvar y_hat resid
{txt} 10{com}.       predict `y_hat'
{txt} 11{com}.       local y : word 1 of `e(depvar)'
{txt} 12{com}.       generate `resid' = `y' - `y_hat' if completed // Limit to uncensored observations.
{txt} 13{com}.       swilk `resid'
{txt} 14{com}.       assert r(p) > 0.05
{txt} 15{com}.     {c )-}
{txt} 16{com}.   {c )-}
{txt} 17{com}. {c )-}
{hline}
{res}Analysis for: {ul:rec_vs_none} with respect to {ul:resource}

{txt}Iteration 0:{space 3}log likelihood = {res:-55.193566}  
Iteration 1:{space 3}log likelihood = {res:-55.193557}  
Iteration 2:{space 3}log likelihood = {res:-55.193557}  
{res}
{txt}Extended interval regression{col 49}Number of obs{col 67}= {res}        32
{txt}{col 49}   Uncensored{col 67}= {res}        30
{txt}{col 49}   Left-censored{col 67}= {res}         0
{txt}{col 49}   Right-censored{col 67}= {res}         2
{txt}{col 49}   Interval-cens.{col 67}= {res}         0

{txt}{col 49}Wald chi2({res}2{txt}){col 67}= {res}      7.22
{txt}Log likelihood = {res}-55.193557{txt}{col 49}Prob > chi2{col 67}= {res}    0.0270

{txt}{hline 36}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 37}{c |}      Coef.{col 49}   Std. Err.{col 61}      z{col 69}   P>|z|{col 77}     [95% Con{col 90}f. Interval]
{hline 36}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 14}meta_analysis_planned {c |}
{space 31}Yes  {c |}{col 37}{res}{space 2}     0.97{col 49}{space 2}     0.37{col 60}{space 1}    2.63{col 69}{space 3} 0.01{col 77}{space 4}     0.25{col 90}{space 3}     1.70
{txt}{space 35} {c |}
{space 24}rec_vs_none {c |}
{space 23}Recommended  {c |}{col 37}{res}{space 2}     1.31{col 49}{space 2}     1.19{col 60}{space 1}    1.11{col 69}{space 3} 0.27{col 77}{space 4}    -1.01{col 90}{space 3}     3.64
{txt}{space 30}_cons {c |}{col 37}{res}{space 2}     4.69{col 49}{space 2}     0.89{col 60}{space 1}    5.28{col 69}{space 3} 0.00{col 77}{space 4}     2.95{col 90}{space 3}     6.43
{txt}{hline 36}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}rec_vs_none                         {txt}{c |}
{space 30}field {c |}
{space 27}Welfare  {c |}{col 37}{res}{space 2}     0.90{col 49}{space 2}     0.48{col 60}{space 1}    1.89{col 69}{space 3} 0.06{col 77}{space 4}    -0.03{col 90}{space 3}     1.83
{txt}{space 30}_cons {c |}{col 37}{res}{space 2}    -0.10{col 49}{space 2}     0.35{col 60}{space 1}   -0.28{col 69}{space 3} 0.78{col 77}{space 4}    -0.78{col 90}{space 3}     0.59
{txt}{hline 36}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 16}var(e.log_resource1){c |}{col 37}{res}{space 2}     0.58{col 49}{space 2}     0.15{col 77}{space 4}     0.35{col 90}{space 3}     0.96
{txt}{hline 36}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}corr(e.rec_vs_none,e.log_resource1){c |}{col 37}{res}{space 2}     0.01{col 49}{space 2}     1.07{col 60}{space 1}    0.01{col 69}{space 3} 0.99{col 77}{space 4}    -0.97{col 90}{space 3}     0.97
{txt}{hline 36}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
(option {bf:mean} assumed; average structural function mean)
{res}{txt}(6 missing values generated)
{res}{txt}(9 missing values generated)

                   Shapiro-Wilk W test for normal data

    Variable {c |}        Obs{col 33}W{col 45}V{col 55}z       Prob>z
{hline 13}{c +}{hline 54}
    __000001 {c |} {res}        30    0.98137      0.592    -1.083    0.86060
{hline}
Analysis for: {ul:rec_vs_none} with respect to {ul:time}

         {txt}failure _d:  {res}completed
   {txt}analysis time _t:  {res}(completion-origin)/7
             {txt}origin:  {res}time commission

{txt}Iteration 0:{space 3}EE criterion = {res:  120.1604}  
Iteration 1:{space 3}EE criterion = {res: 61.060309}  
Iteration 2:{space 3}EE criterion = {res: 11.632408}  
Iteration 3:{space 3}EE criterion = {res: .55421372}  
Iteration 4:{space 3}EE criterion = {res: .06729877}  
Iteration 5:{space 3}EE criterion = {res: 6.402e-06}  
Iteration 6:{space 3}EE criterion = {res: 4.318e-12}  
Iteration 7:{space 3}EE criterion = {res: 1.936e-24}  
{res}
{txt}Survival treatment-effects estimation{col 49}Number of obs {col 67}= {res}        32
{txt:Estimator}{col 16}:{res: IPW regression adjustment}
{txt:Outcome model}{col 16}:{res: Weibull}
{txt:Treatment model}{col 16}:{res: logit}
{txt:Censoring model}{col 16}:{res: none}
{txt}{hline 23}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 24}{c |}{col 36}    Robust
{col 1}                    _t{col 24}{c |}      Coef.{col 36}   Std. Err.{col 48}      z{col 56}   P>|z|{col 64}     [95% Con{col 77}f. Interval]
{hline 23}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}ATE                    {txt}{c |}
{space 11}rec_vs_none {c |}
(Recommended vs None)  {c |}{col 24}{res}{space 2}    -3.02{col 36}{space 2}     9.65{col 47}{space 1}   -0.31{col 56}{space 3} 0.75{col 64}{space 4}   -21.93{col 77}{space 3}    15.90
{txt}{hline 23}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}POmean                 {txt}{c |}
{space 11}rec_vs_none {c |}
{space 17}None  {c |}{col 24}{res}{space 2}    36.34{col 36}{space 2}     7.68{col 47}{space 1}    4.73{col 56}{space 3} 0.00{col 64}{space 4}    21.28{col 77}{space 3}    51.40
{txt}{hline 23}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}OME0                   {txt}{c |}
{space 1}meta_analysis_planned {c |}
{space 18}Yes  {c |}{col 24}{res}{space 2}     1.71{col 36}{space 2}     0.19{col 47}{space 1}    8.88{col 56}{space 3} 0.00{col 64}{space 4}     1.33{col 77}{space 3}     2.09
{txt}{space 17}_cons {c |}{col 24}{res}{space 2}     2.61{col 36}{space 2}     0.10{col 47}{space 1}   26.56{col 56}{space 3} 0.00{col 64}{space 4}     2.42{col 77}{space 3}     2.80
{txt}{hline 23}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}OME0_lnshape           {txt}{c |}
{space 17}_cons {c |}{col 24}{res}{space 2}     1.14{col 36}{space 2}     0.25{col 47}{space 1}    4.60{col 56}{space 3} 0.00{col 64}{space 4}     0.65{col 77}{space 3}     1.62
{txt}{hline 23}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}OME1                   {txt}{c |}
{space 1}meta_analysis_planned {c |}
{space 18}Yes  {c |}{col 24}{res}{space 2}     0.44{col 36}{space 2}     0.39{col 47}{space 1}    1.14{col 56}{space 3} 0.26{col 64}{space 4}    -0.32{col 77}{space 3}     1.21
{txt}{space 17}_cons {c |}{col 24}{res}{space 2}     3.39{col 36}{space 2}     0.22{col 47}{space 1}   15.70{col 56}{space 3} 0.00{col 64}{space 4}     2.97{col 77}{space 3}     3.81
{txt}{hline 23}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}OME1_lnshape           {txt}{c |}
{space 17}_cons {c |}{col 24}{res}{space 2}     0.40{col 36}{space 2}     0.16{col 47}{space 1}    2.40{col 56}{space 3} 0.02{col 64}{space 4}     0.07{col 77}{space 3}     0.72
{txt}{hline 23}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}TME1                   {txt}{c |}
{space 17}field {c |}
{space 14}Welfare  {c |}{col 24}{res}{space 2}     1.54{col 36}{space 2}     0.78{col 47}{space 1}    1.97{col 56}{space 3} 0.05{col 64}{space 4}     0.01{col 77}{space 3}     3.08
{txt}{space 22} {c |}
{space 10}prespecified {c |}
{space 18}Yes  {c |}{col 24}{res}{space 2}     0.00{col 36}{txt}  (omitted)
{space 17}_cons {c |}{col 24}{res}{space 2}    -0.29{col 36}{space 2}     0.54{col 47}{space 1}   -0.53{col 56}{space 3} 0.59{col 64}{space 4}    -1.35{col 77}{space 3}     0.77
{txt}{hline 23}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{hline}
{res}Analysis for: {ul:rec_vs_nonrec} with respect to {ul:resource}

{txt}Iteration 0:{space 3}log likelihood = {res:-45.294405}  (not concave)
Iteration 1:{space 3}log likelihood = {res:-43.745161}  (not concave)
Iteration 2:{space 3}log likelihood = {res:-43.224654}  (not concave)
Iteration 3:{space 3}log likelihood = {res:-43.122452}  (not concave)
Iteration 4:{space 3}log likelihood = {res:-43.071866}  (not concave)
Iteration 5:{space 3}log likelihood = {res:-42.965075}  
Iteration 6:{space 3}log likelihood = {res:-42.579615}  
Iteration 7:{space 3}log likelihood = {res:-42.254791}  
Iteration 8:{space 3}log likelihood = {res:-42.193133}  
Iteration 9:{space 3}log likelihood = {res:-42.160625}  
Iteration 10:{space 2}log likelihood = {res:-42.156699}  
Iteration 11:{space 2}log likelihood = {res:-42.156242}  
Iteration 12:{space 2}log likelihood = {res:-42.156242}  
{res}
{txt}Extended interval regression{col 49}Number of obs{col 67}= {res}        27
{txt}{col 49}   Uncensored{col 67}= {res}        24
{txt}{col 49}   Left-censored{col 67}= {res}         0
{txt}{col 49}   Right-censored{col 67}= {res}         3
{txt}{col 49}   Interval-cens.{col 67}= {res}         0

{txt}{col 49}Wald chi2({res}2{txt}){col 67}= {res}      1.93
{txt}Log likelihood = {res}-42.156242{txt}{col 49}Prob > chi2{col 67}= {res}    0.3813

{txt}{hline 38}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 39}{c |}      Coef.{col 51}   Std. Err.{col 63}      z{col 71}   P>|z|{col 79}     [95% Con{col 92}f. Interval]
{hline 38}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 16}meta_analysis_planned {c |}
{space 33}Yes  {c |}{col 39}{res}{space 2}     0.32{col 51}{space 2}     0.28{col 62}{space 1}    1.11{col 71}{space 3} 0.27{col 79}{space 4}    -0.24{col 92}{space 3}     0.87
{txt}{space 37} {c |}
{space 24}rec_vs_nonrec {c |}
{space 25}Recommended  {c |}{col 39}{res}{space 2}    -0.69{col 51}{space 2}     1.56{col 62}{space 1}   -0.44{col 71}{space 3} 0.66{col 79}{space 4}    -3.76{col 92}{space 3}     2.37
{txt}{space 32}_cons {c |}{col 39}{res}{space 2}     6.94{col 51}{space 2}     1.28{col 62}{space 1}    5.42{col 71}{space 3} 0.00{col 79}{space 4}     4.43{col 92}{space 3}     9.45
{txt}{hline 38}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}rec_vs_nonrec                         {txt}{c |}
{space 25}prespecified {c |}
{space 33}Yes  {c |}{col 39}{res}{space 2}    -0.26{col 51}{space 2}     0.56{col 62}{space 1}   -0.47{col 71}{space 3} 0.64{col 79}{space 4}    -1.37{col 92}{space 3}     0.84
{txt}{space 32}_cons {c |}{col 39}{res}{space 2}     0.92{col 51}{space 2}     0.44{col 62}{space 1}    2.11{col 71}{space 3} 0.03{col 79}{space 4}     0.07{col 92}{space 3}     1.78
{txt}{hline 38}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 18}var(e.log_resource1){c |}{col 39}{res}{space 2}     0.49{col 51}{space 2}     0.21{col 79}{space 4}     0.21{col 92}{space 3}     1.15
{txt}{hline 38}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}corr(e.rec_vs_nonrec,e.log_resource1){c |}{col 39}{res}{space 2}     0.24{col 51}{space 2}     1.24{col 62}{space 1}    0.20{col 71}{space 3} 0.84{col 79}{space 4}    -0.98{col 92}{space 3}     0.99
{txt}{hline 38}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
(option {bf:mean} assumed; average structural function mean)
{res}{txt}(12 missing values generated)
{res}{txt}(15 missing values generated)

                   Shapiro-Wilk W test for normal data

    Variable {c |}        Obs{col 33}W{col 45}V{col 55}z       Prob>z
{hline 13}{c +}{hline 54}
    __000003 {c |} {res}        24    0.96123      1.046     0.091    0.46365
{hline}
Analysis for: {ul:rec_vs_nonrec} with respect to {ul:time}

         {txt}failure _d:  {res}completed
   {txt}analysis time _t:  {res}(completion-origin)/7
             {txt}origin:  {res}time commission

{txt}Iteration 0:{space 3}EE criterion = {res: 1.532e-14}  
Iteration 1:{space 3}EE criterion = {res: 5.342e-27}  
{res}
{txt}Survival treatment-effects estimation{col 49}Number of obs {col 67}= {res}        26
{txt:Estimator}{col 16}:{res: IPW regression adjustment}
{txt:Outcome model}{col 16}:{res: Weibull}
{txt:Treatment model}{col 16}:{res: logit}
{txt:Censoring model}{col 16}:{res: none}
{txt}{hline 34}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 35}{c |}{col 47}    Robust
{col 1}                               _t{col 35}{c |}      Coef.{col 47}   Std. Err.{col 59}      z{col 67}   P>|z|{col 75}     [95% Con{col 88}f. Interval]
{hline 34}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}ATE                               {txt}{c |}
{space 20}rec_vs_nonrec {c |}
(Recommended vs Non-recommended)  {c |}{col 35}{res}{space 2}     3.83{col 47}{space 2}     8.79{col 58}{space 1}    0.44{col 67}{space 3} 0.66{col 75}{space 4}   -13.39{col 88}{space 3}    21.06
{txt}{hline 34}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}POmean                            {txt}{c |}
{space 20}rec_vs_nonrec {c |}
{space 17}Non-recommended  {c |}{col 35}{res}{space 2}    30.87{col 47}{space 2}     5.66{col 58}{space 1}    5.45{col 67}{space 3} 0.00{col 75}{space 4}    19.77{col 88}{space 3}    41.97
{txt}{hline 34}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}OME0                              {txt}{c |}
{space 12}meta_analysis_planned {c |}
{space 29}Yes  {c |}{col 35}{res}{space 2}     0.37{col 47}{space 2}     0.34{col 58}{space 1}    1.09{col 67}{space 3} 0.28{col 75}{space 4}    -0.29{col 88}{space 3}     1.03
{txt}{space 28}_cons {c |}{col 35}{res}{space 2}     3.33{col 47}{space 2}     0.25{col 58}{space 1}   13.23{col 67}{space 3} 0.00{col 75}{space 4}     2.84{col 88}{space 3}     3.83
{txt}{hline 34}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}OME0_lnshape                      {txt}{c |}
{space 28}_cons {c |}{col 35}{res}{space 2}     0.66{col 47}{space 2}     0.10{col 58}{space 1}    6.87{col 67}{space 3} 0.00{col 75}{space 4}     0.47{col 88}{space 3}     0.85
{txt}{hline 34}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}OME1                              {txt}{c |}
{space 12}meta_analysis_planned {c |}
{space 29}Yes  {c |}{col 35}{res}{space 2}     0.44{col 47}{space 2}     0.38{col 58}{space 1}    1.15{col 67}{space 3} 0.25{col 75}{space 4}    -0.31{col 88}{space 3}     1.19
{txt}{space 28}_cons {c |}{col 35}{res}{space 2}     3.39{col 47}{space 2}     0.22{col 58}{space 1}   15.70{col 67}{space 3} 0.00{col 75}{space 4}     2.97{col 88}{space 3}     3.81
{txt}{hline 34}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}OME1_lnshape                      {txt}{c |}
{space 28}_cons {c |}{col 35}{res}{space 2}     0.40{col 47}{space 2}     0.16{col 58}{space 1}    2.50{col 67}{space 3} 0.01{col 75}{space 4}     0.09{col 88}{space 3}     0.72
{txt}{hline 34}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}TME1                              {txt}{c |}
{space 28}field {c |}
{space 25}Welfare  {c |}{col 35}{res}{space 2}     2.49{col 47}{space 2}     1.40{col 58}{space 1}    1.78{col 67}{space 3} 0.07{col 75}{space 4}    -0.25{col 88}{space 3}     5.24
{txt}{space 33} {c |}
{space 21}prespecified {c |}
{space 29}Yes  {c |}{col 35}{res}{space 2}     0.13{col 47}{space 2}     1.19{col 58}{space 1}    0.11{col 67}{space 3} 0.91{col 75}{space 4}    -2.20{col 88}{space 3}     2.46
{txt}{space 28}_cons {c |}{col 35}{res}{space 2}     0.09{col 47}{space 2}     1.06{col 58}{space 1}    0.08{col 67}{space 3} 0.94{col 75}{space 4}    -2.00{col 88}{space 3}     2.17
{txt}{hline 34}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{hline}
{res}Analysis for: {ul:any_vs_none} with respect to {ul:resource}

{txt}Iteration 0:{space 3}log likelihood = {res:-66.568371}  (not concave)
Iteration 1:{space 3}log likelihood = {res:-65.528145}  (not concave)
Iteration 2:{space 3}log likelihood = {res:-65.469714}  
Iteration 3:{space 3}log likelihood = {res:-65.102147}  
Iteration 4:{space 3}log likelihood = {res:-64.985316}  
Iteration 5:{space 3}log likelihood = {res: -64.98295}  
Iteration 6:{space 3}log likelihood = {res:-64.982942}  
Iteration 7:{space 3}log likelihood = {res:-64.982942}  
{res}
{txt}Extended interval regression{col 49}Number of obs{col 67}= {res}        38
{txt}{col 49}   Uncensored{col 67}= {res}        35
{txt}{col 49}   Left-censored{col 67}= {res}         0
{txt}{col 49}   Right-censored{col 67}= {res}         3
{txt}{col 49}   Interval-cens.{col 67}= {res}         0

{txt}{col 49}Wald chi2({res}2{txt}){col 67}= {res}     10.37
{txt}Log likelihood = {res}-64.982942{txt}{col 49}Prob > chi2{col 67}= {res}    0.0056

{txt}{hline 36}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 37}{c |}      Coef.{col 49}   Std. Err.{col 61}      z{col 69}   P>|z|{col 77}     [95% Con{col 90}f. Interval]
{hline 36}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 14}meta_analysis_planned {c |}
{space 31}Yes  {c |}{col 37}{res}{space 2}     0.99{col 49}{space 2}     0.31{col 60}{space 1}    3.17{col 69}{space 3} 0.00{col 77}{space 4}     0.38{col 90}{space 3}     1.61
{txt}{space 35} {c |}
{space 24}any_vs_none {c |}
{space 31}Any  {c |}{col 37}{res}{space 2}    -0.43{col 49}{space 2}     0.55{col 60}{space 1}   -0.77{col 69}{space 3} 0.44{col 77}{space 4}    -1.52{col 90}{space 3}     0.66
{txt}{space 30}_cons {c |}{col 37}{res}{space 2}     5.97{col 49}{space 2}     0.41{col 60}{space 1}   14.42{col 69}{space 3} 0.00{col 77}{space 4}     5.16{col 90}{space 3}     6.79
{txt}{hline 36}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}any_vs_none                         {txt}{c |}
{space 30}field {c |}
{space 27}Welfare  {c |}{col 37}{res}{space 2}     0.59{col 49}{space 2}     0.31{col 60}{space 1}    1.89{col 69}{space 3} 0.06{col 77}{space 4}    -0.02{col 90}{space 3}     1.20
{txt}{space 30}_cons {c |}{col 37}{res}{space 2}     0.28{col 49}{space 2}     0.25{col 60}{space 1}    1.13{col 69}{space 3} 0.26{col 77}{space 4}    -0.21{col 90}{space 3}     0.76
{txt}{hline 36}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 16}var(e.log_resource1){c |}{col 37}{res}{space 2}     1.34{col 49}{space 2}     0.55{col 77}{space 4}     0.61{col 90}{space 3}     2.98
{txt}{hline 36}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}corr(e.any_vs_none,e.log_resource1){c |}{col 37}{res}{space 2}     0.95{col 49}{space 2}     0.08{col 60}{space 1}   12.47{col 69}{space 3} 0.00{col 77}{space 4}     0.25{col 90}{space 3}     1.00
{txt}{hline 36}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
(option {bf:mean} assumed; average structural function mean)
{res}{txt}(4 missing values generated)

                   Shapiro-Wilk W test for normal data

    Variable {c |}        Obs{col 33}W{col 45}V{col 55}z       Prob>z
{hline 13}{c +}{hline 54}
    __000005 {c |} {res}        35    0.98845      0.412    -1.850    0.96787
{hline}
Analysis for: {ul:any_vs_none} with respect to {ul:time}

         {txt}failure _d:  {res}completed
   {txt}analysis time _t:  {res}(completion-origin)/7
             {txt}origin:  {res}time commission

{txt}Iteration 0:{space 3}EE criterion = {res: 19.503406}  
Iteration 1:{space 3}EE criterion = {res: 3.0309072}  
Iteration 2:{space 3}EE criterion = {res: 1.4895084}  
Iteration 3:{space 3}EE criterion = {res: .07823929}  
Iteration 4:{space 3}EE criterion = {res: .00005116}  
Iteration 5:{space 3}EE criterion = {res: 1.580e-09}  
Iteration 6:{space 3}EE criterion = {res: 2.081e-19}  
{res}
{txt}Survival treatment-effects estimation{col 49}Number of obs {col 67}= {res}        38
{txt:Estimator}{col 16}:{res: IPW regression adjustment}
{txt:Outcome model}{col 16}:{res: Weibull}
{txt:Treatment model}{col 16}:{res: logit}
{txt:Censoring model}{col 16}:{res: none}
{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}                   _t{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}ATE                   {txt}{c |}
{space 10}any_vs_none {c |}
{space 7}(Any vs None)  {c |}{col 23}{res}{space 2}    -2.48{col 35}{space 2}     9.15{col 46}{space 1}   -0.27{col 55}{space 3} 0.79{col 63}{space 4}   -20.41{col 76}{space 3}    15.45
{txt}{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}POmean                {txt}{c |}
{space 10}any_vs_none {c |}
{space 16}None  {c |}{col 23}{res}{space 2}    37.97{col 35}{space 2}     7.98{col 46}{space 1}    4.76{col 55}{space 3} 0.00{col 63}{space 4}    22.34{col 76}{space 3}    53.60
{txt}{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}OME0                  {txt}{c |}
meta_analysis_planned {c |}
{space 17}Yes  {c |}{col 23}{res}{space 2}     1.71{col 35}{space 2}     0.20{col 46}{space 1}    8.60{col 55}{space 3} 0.00{col 63}{space 4}     1.32{col 76}{space 3}     2.10
{txt}{space 16}_cons {c |}{col 23}{res}{space 2}     2.61{col 35}{space 2}     0.10{col 46}{space 1}   26.73{col 55}{space 3} 0.00{col 63}{space 4}     2.41{col 76}{space 3}     2.80
{txt}{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}OME0_lnshape          {txt}{c |}
{space 16}_cons {c |}{col 23}{res}{space 2}     1.10{col 35}{space 2}     0.24{col 46}{space 1}    4.50{col 55}{space 3} 0.00{col 63}{space 4}     0.62{col 76}{space 3}     1.58
{txt}{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}OME1                  {txt}{c |}
meta_analysis_planned {c |}
{space 17}Yes  {c |}{col 23}{res}{space 2}     0.55{col 35}{space 2}     0.29{col 46}{space 1}    1.89{col 55}{space 3} 0.06{col 63}{space 4}    -0.02{col 76}{space 3}     1.11
{txt}{space 16}_cons {c |}{col 23}{res}{space 2}     3.38{col 35}{space 2}     0.17{col 46}{space 1}   19.35{col 55}{space 3} 0.00{col 63}{space 4}     3.04{col 76}{space 3}     3.73
{txt}{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}OME1_lnshape          {txt}{c |}
{space 16}_cons {c |}{col 23}{res}{space 2}     0.47{col 35}{space 2}     0.12{col 46}{space 1}    4.04{col 55}{space 3} 0.00{col 63}{space 4}     0.24{col 76}{space 3}     0.69
{txt}{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}TME1                  {txt}{c |}
{space 16}field {c |}
{space 13}Welfare  {c |}{col 23}{res}{space 2}     1.00{col 35}{space 2}     0.73{col 46}{space 1}    1.37{col 55}{space 3} 0.17{col 63}{space 4}    -0.43{col 76}{space 3}     2.43
{txt}{space 21} {c |}
{space 9}prespecified {c |}
{space 17}Yes  {c |}{col 23}{res}{space 2}     0.00{col 35}{txt}  (omitted)
{space 16}_cons {c |}{col 23}{res}{space 2}     0.32{col 35}{space 2}     0.46{col 46}{space 1}    0.69{col 55}{space 3} 0.49{col 63}{space 4}    -0.59{col 76}{space 3}     1.23
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
{txt}end of do-file

{com}. 
. // Make figures
. do figures/figures
{txt}
{com}. version 16.1
{txt}
{com}. set graphics off
{txt}
{com}. 
. // Specify options for the KM plots.
. local opts        ci ci1opts(fcolor(navy%20)) ci2opts(fcolor(maroon%20)) // Translucent CI bands.
{txt}
{com}. local opts `opts' legend(ring(0) position(5)) // Position of the legend.
{txt}
{com}. local opts `opts' legend(order(5 6)) // legend keys to show (i.e., do not show boxes for CI bands in legend).
{txt}
{com}. local opts `opts' risktable(, title("Incomplete Reviews"))               // Title.
{txt}
{com}. local opts `opts' censored(number)                                       // Indicate number of censorings.
{txt}
{com}. local opts `opts' xtitle("Weeks After Review Commission")                // X-axis title.
{txt}
{com}. local opts `opts' ylabel(0 "0%" 0.25 "25%" 0.5 "50%" 0.75 "75%" 1 "100%", angle(0) nogrid) // Y-axis ticks etc.
{txt}
{com}. local opts `opts' ytitle("Completed Reviews (95% CI)")
{txt}
{com}. 
. // Make a Kaplan-Meier plot for each comparison.
. foreach comparison of global comparisons {c -(}  
{txt}  2{com}.   // Get the name of the comparison for the filename and figure title.
.   local comparison_name : variable label `comparison'
{txt}  3{com}. 
.   // Specify the risk table row titles.
.   levelsof `comparison'
{txt}  4{com}.   assert r(r) == 2
{txt}  5{com}.   local levels `r(levels)'
{txt}  6{com}.   local risktable ""
{txt}  7{com}.   local legend ""
{txt}  8{com}.   forvalues i = 1/2 {c -(}
{txt}  9{com}.     local this_level : word `i' of `levels'
{txt} 10{com}.     local rowtitle : label (`comparison') `this_level'
{txt} 11{com}.     local risktable `risktable' risktable(, rowtitle("`rowtitle'") group(`this_level'))
{txt} 12{com}.     local legend `legend' legend(label(`=4+`i'' "`rowtitle'")) // Use custom labels for the legend.
{txt} 13{com}.   {c )-}
{txt} 14{com}. 
.   // Make the figure.
.   sts graph , failure by(`comparison') `opts' `risktable' `legend' title("")
{txt} 15{com}.   
.   // Save the figure in the required formats.
.   foreach format in png pdf tif {c -(}
{txt} 16{com}.     local width ""
{txt} 17{com}.     if "`format'" == "png" local width width(3000)
{txt} 18{com}.     local filename "products/Time-to-completion for `comparison_name'.`format'"
{txt} 19{com}.     graph export "`filename'" , `width' replace
{txt} 20{com}.     if "`format'" == "tif" {c -(}
{txt} 21{com}.       !sips -s formatOptions lzw "`filename'" // Use sips to LZW-compress the file.
{txt} 22{com}.     {c )-}
{txt} 23{com}.   {c )-}
{txt} 24{com}. {c )-}
{res}{txt}0 1

         failure _d:  {res}completed
   {txt}analysis time _t:  {res}(completion-origin)/7
             {txt}origin:  {res}time commission
{txt}(file /Users/cjr/Repos/fhi.ml-resource-time.2023/products/Time-to-completion for Recommended vs No ML Use.png written in PNG format)
(file products/Time-to-completion for Recommended vs No ML Use.pdf written in PDF format)
(file /Users/cjr/Repos/fhi.ml-resource-time.2023/products/Time-to-completion for Recommended vs No ML Use.tif written in TIFF format)

/Users/cjr/Repos/fhi.ml-resource-time.2023/products/Time-to-completion for Recommended vs No ML Use.tif
  /Users/cjr/Repos/fhi.ml-resource-time.2023/products/Time-to-completion for Recommended vs No ML Use.tif
{res}{txt}0 1

         failure _d:  {res}completed
   {txt}analysis time _t:  {res}(completion-origin)/7
             {txt}origin:  {res}time commission
{txt}(file /Users/cjr/Repos/fhi.ml-resource-time.2023/products/Time-to-completion for Recommended vs Non-recommended ML Use.png written in PNG format)
(file products/Time-to-completion for Recommended vs Non-recommended ML Use.pdf written in PDF format)
(file /Users/cjr/Repos/fhi.ml-resource-time.2023/products/Time-to-completion for Recommended vs Non-recommended ML Use.tif written in TIFF format)

/Users/cjr/Repos/fhi.ml-resource-time.2023/products/Time-to-completion for Recommended vs Non-recommended ML Use.tif
  /Users/cjr/Repos/fhi.ml-resource-time.2023/products/Time-to-completion for Recommended vs Non-recommended ML Use.tif
{res}{txt}0 1

         failure _d:  {res}completed
   {txt}analysis time _t:  {res}(completion-origin)/7
             {txt}origin:  {res}time commission
{txt}(file /Users/cjr/Repos/fhi.ml-resource-time.2023/products/Time-to-completion for Any vs No ML Use.png written in PNG format)
(file products/Time-to-completion for Any vs No ML Use.pdf written in PDF format)
(file /Users/cjr/Repos/fhi.ml-resource-time.2023/products/Time-to-completion for Any vs No ML Use.tif written in TIFF format)

/Users/cjr/Repos/fhi.ml-resource-time.2023/products/Time-to-completion for Any vs No ML Use.tif
  /Users/cjr/Repos/fhi.ml-resource-time.2023/products/Time-to-completion for Any vs No ML Use.tif

{com}. 
. set graphics on
{txt}
{com}. 
{txt}end of do-file

{com}. 
. // Obtain the git revision hash, which is used in the reports.
. tempfile git_revision_filename
{txt}
{com}. tempname revision_file
{txt}
{com}. shell git rev-parse --short HEAD > "`git_revision_filename'"
{txt}

{com}. file open `revision_file' using `git_revision_filename', read text
{txt}
{com}. file read `revision_file' line
{txt}
{com}. global git_revision = "`macval(line)'"
{txt}
{com}. 
. // Make the report.
. do reports/report
{txt}
{com}. version 16.1
{txt}
{com}. 
. // Some locals to make this file a little more readable.
. local heading putdocx paragraph, style(Heading1)
{txt}
{com}. local subhead putdocx paragraph, style(Heading2)
{txt}
{com}. local newpara putdocx textblock begin, halign(both)
{txt}
{com}. local putdocx textblock end putdocx textblock end
{txt}
{com}. 
. local p_fmt  %5.2f // Format used for P-values.
{txt}
{com}. local e_fmt  %5.2f // Format used for estimates.
{txt}
{com}. local pc_fmt %8.1f // Format used for percentages.
{txt}
{com}. 
. // Start the document.
. putdocx begin
{res}{txt}
{com}. 
. // Title.
. putdocx paragraph, style(Title)
{res}{txt}
{com}. putdocx text ("The effect of machine learning tools for evidence synthesis on resource use and time-to-completion")
{res}{txt}
{com}. 
. // Author and revision information.
. `newpara'
{res}{txt}
{com}. `newpara'
{res}{txt}
{com}. 
. // Methods section
. `heading'
{res}{txt}
{com}. putdocx text ("Methods")
{res}{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. `heading'
{res}{txt}
{com}. putdocx text ("Protocol Deviations")
{res}{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. // Start a new page.
. putdocx pagebreak
{res}{txt}
{com}. 
. // Results section
. `heading'
{res}{txt}
{com}. putdocx text ("Results")
{res}{txt}
{com}. 
. // Insert the table of sample characteristics.
. sample_characteristics
{res}  39
  12
  21
  6
  21
  12
  27
  39
  12
  19
  5
  19
  12
  24
  39
  3
  2
  2
  2
  3
  4
  39
  9
  19
  4
  19
  9
  23
  39
  11
  19
  6
  19
  11
  25
  39
  4
  10
  4
  10
  4
  14
  39
  0
  0
  0
  0
  0
  0
  39
  0
  19
  6
  19
  0
  25
  39
  0
  9
  3
  9
  0
  12
  39
  0
  6
  2
  6
  0
  8
  39
  0
  5
  0
  5
  0
  5
  39
  0
  0
  0
  0
  0
  0
  39
  0
  1
  0
  1
  0
  1
  39
  0
  0
  0
  0
  0
  0
  39
  0
  0
  0
  0
  0
  0
{txt}
{com}. 
. // Insert the table of results.
. results_table
{res}{txt}0 1
  {res}12

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
log_resour~1 {c |}{res}         11    4.942194    1.233002   3.218876   6.958448
  21

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
log_resour~1 {c |}{res}         19    6.344384    .6060508   5.192957   7.273787
{txt}(results {stata estimates replay rec_vs_none_resource:rec_vs_none_resource} are active now)

{p 0 7}{space 1}{text:( 1)}{space 1} {res}[log_resource1]1.rec_vs_none = 0{p_end}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}     exp(b){col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}(1) {c |}{col 14}{res}{space 2}     3.71{col 26}{space 2}     4.40{col 37}{space 1}    1.11{col 46}{space 3} 0.27{col 54}{space 4}     0.36{col 67}{space 3}    37.95
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}0 1
  {res}6

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
log_resour~1 {c |}{res}          5    6.789035    .8300506   5.828946   7.728416
  21

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
log_resour~1 {c |}{res}         19    6.344384    .6060508   5.192957   7.273787
{txt}(results {stata estimates replay rec_vs_nonrec_resource:rec_vs_nonrec_resource} are active now)

{p 0 7}{space 1}{text:( 1)}{space 1} {res}[log_resource1]1.rec_vs_nonrec = 0{p_end}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}     exp(b){col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}(1) {c |}{col 14}{res}{space 2}     0.50{col 26}{space 2}     0.78{col 37}{space 1}   -0.44{col 46}{space 3} 0.66{col 54}{space 4}     0.02{col 67}{space 3}    10.74
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}0 1
  {res}12

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
log_resour~1 {c |}{res}         11    4.942194    1.233002   3.218876   6.958448
  27

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
log_resour~1 {c |}{res}         24     6.43702    .6643046   5.192957   7.728416
{txt}(results {stata estimates replay any_vs_none_resource:any_vs_none_resource} are active now)

{p 0 7}{space 1}{text:( 1)}{space 1} {res}[log_resource1]1.any_vs_none = 0{p_end}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}     exp(b){col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}(1) {c |}{col 14}{res}{space 2}     0.65{col 26}{space 2}     0.36{col 37}{space 1}   -0.77{col 46}{space 3} 0.44{col 54}{space 4}     0.22{col 67}{space 3}     1.93
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}0 1
  {res}12

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}_t {c |}{res}         12     28.2381     31.0725   4.857143   101.8571
  21

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}_t {c |}{res}         18     27.5873    15.44062   7.142857         60
{txt}(results {stata estimates replay rec_vs_none_time:rec_vs_none_time} are active now)

       _nl_1:  {res}log(_b[ATE:r1vs0.rec_vs_none] + _b[POmean:0.rec_vs_none]) - log(_b[POmean:0.rec_vs_none])

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          _t{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_nl_1 {c |}{col 14}{res}{space 2}    -0.09{col 26}{space 2}     0.28{col 37}{space 1}   -0.31{col 46}{space 3} 0.75{col 54}{space 4}    -0.63{col 67}{space 3}     0.45
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{p 0 7}{space 1}{text:( 1)}{space 1} {res}_nl_1 = 0{p_end}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          _t{col 14}{c |}     exp(b){col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}(1) {c |}{col 14}{res}{space 2}     0.92{col 26}{space 2}     0.25{col 37}{space 1}   -0.31{col 46}{space 3} 0.75{col 54}{space 4}     0.53{col 67}{space 3}     1.58
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}0 1
  {res}6

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}_t {c |}{res}          5    36.22857    26.41073   15.57143   81.42857
  21

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}_t {c |}{res}         18     27.5873    15.44062   7.142857         60
{txt}(results {stata estimates replay rec_vs_nonrec_time:rec_vs_nonrec_time} are active now)

       _nl_1:  {res}log(_b[ATE:r1vs0.rec_vs_nonrec] + _b[POmean:0.rec_vs_nonrec]) - log(_b[POmean:0.rec_vs_nonrec])

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          _t{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_nl_1 {c |}{col 14}{res}{space 2}     0.12{col 26}{space 2}     0.26{col 37}{space 1}    0.44{col 46}{space 3} 0.66{col 54}{space 4}    -0.40{col 67}{space 3}     0.64
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{p 0 7}{space 1}{text:( 1)}{space 1} {res}_nl_1 = 0{p_end}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          _t{col 14}{c |}     exp(b){col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}(1) {c |}{col 14}{res}{space 2}     1.12{col 26}{space 2}     0.30{col 37}{space 1}    0.44{col 46}{space 3} 0.66{col 54}{space 4}     0.67{col 67}{space 3}     1.89
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}0 1
  {res}12

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}_t {c |}{res}         12     28.2381     31.0725   4.857143   101.8571
  27

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}_t {c |}{res}         23    29.46584    18.00923   7.142857   81.42857
{txt}(results {stata estimates replay any_vs_none_time:any_vs_none_time} are active now)

       _nl_1:  {res}log(_b[ATE:r1vs0.any_vs_none] + _b[POmean:0.any_vs_none]) - log(_b[POmean:0.any_vs_none])

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          _t{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_nl_1 {c |}{col 14}{res}{space 2}    -0.07{col 26}{space 2}     0.25{col 37}{space 1}   -0.27{col 46}{space 3} 0.78{col 54}{space 4}    -0.55{col 67}{space 3}     0.42
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{p 0 7}{space 1}{text:( 1)}{space 1} {res}_nl_1 = 0{p_end}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          _t{col 14}{c |}     exp(b){col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}(1) {c |}{col 14}{res}{space 2}     0.93{col 26}{space 2}     0.23{col 37}{space 1}   -0.27{col 46}{space 3} 0.78{col 54}{space 4}     0.58{col 67}{space 3}     1.51
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. // Start a new page.
. putdocx pagebreak
{res}{txt}
{com}. 
. // Insert the Kaplan-Meier plots.
. foreach comparison of global comparisons {c -(}
{txt}  2{com}.   local comparison_name : variable label `comparison'
{txt}  3{com}.   local title "Kaplan-Meier estimates for `comparison_name'"
{txt}  4{com}. 
.   `subhead'
{txt}  5{com}.   putdocx text ("`title'")
{txt}  6{com}.   putdocx image "products/Time-to-completion for `comparison_name'.png", linebreak
{txt}  7{com}. {c )-}
{res}{txt}
{com}. 
. // Discussion section
. `heading'
{res}{txt}
{com}. putdocx text ("Discussion")
{res}{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. `newpara'
{res}{txt}
{com}. 
. `heading'
{res}{txt}
{com}. putdocx text ("Appendix — Full Regression Results")
{res}{txt}
{com}. 
. foreach comparison of global comparisons {c -(}
{txt}  2{com}.   foreach outcome of global outcomes {c -(}
{txt}  3{com}.     `subhead'
{txt}  4{com}.     putdocx text ("Regression results for `comparison' with respect to `outcome'")
{txt}  5{com}. 
.     estimates restore `comparison'_`outcome'
{txt}  6{com}.     estimates replay `comparison'_`outcome'
{txt}  7{com}.     putdocx table `comparison'_`outcome' = etable
{txt}  8{com}.   {c )-}
{txt}  9{com}. {c )-}
{res}{txt}(results {stata estimates replay rec_vs_none_resource:rec_vs_none_resource} are active now)

{hline}
{p 0 8}Model {hi:rec_vs_none_resource}{p_end}
{hline}

Extended interval regression{col 49}Number of obs{col 67}= {res}        32
{txt}{col 49}   Uncensored{col 67}= {res}        30
{txt}{col 49}   Left-censored{col 67}= {res}         0
{txt}{col 49}   Right-censored{col 67}= {res}         2
{txt}{col 49}   Interval-cens.{col 67}= {res}         0

{txt}{col 49}Wald chi2({res}2{txt}){col 67}= {res}      7.22
{txt}Log likelihood = {res}-55.193557{txt}{col 49}Prob > chi2{col 67}= {res}    0.0270

{txt}{hline 36}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 37}{c |}      Coef.{col 49}   Std. Err.{col 61}      z{col 69}   P>|z|{col 77}     [95% Con{col 90}f. Interval]
{hline 36}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 14}meta_analysis_planned {c |}
{space 31}Yes  {c |}{col 37}{res}{space 2}     0.97{col 49}{space 2}     0.37{col 60}{space 1}    2.63{col 69}{space 3} 0.01{col 77}{space 4}     0.25{col 90}{space 3}     1.70
{txt}{space 35} {c |}
{space 24}rec_vs_none {c |}
{space 23}Recommended  {c |}{col 37}{res}{space 2}     1.31{col 49}{space 2}     1.19{col 60}{space 1}    1.11{col 69}{space 3} 0.27{col 77}{space 4}    -1.01{col 90}{space 3}     3.64
{txt}{space 30}_cons {c |}{col 37}{res}{space 2}     4.69{col 49}{space 2}     0.89{col 60}{space 1}    5.28{col 69}{space 3} 0.00{col 77}{space 4}     2.95{col 90}{space 3}     6.43
{txt}{hline 36}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}rec_vs_none                         {txt}{c |}
{space 30}field {c |}
{space 27}Welfare  {c |}{col 37}{res}{space 2}     0.90{col 49}{space 2}     0.48{col 60}{space 1}    1.89{col 69}{space 3} 0.06{col 77}{space 4}    -0.03{col 90}{space 3}     1.83
{txt}{space 30}_cons {c |}{col 37}{res}{space 2}    -0.10{col 49}{space 2}     0.35{col 60}{space 1}   -0.28{col 69}{space 3} 0.78{col 77}{space 4}    -0.78{col 90}{space 3}     0.59
{txt}{hline 36}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 16}var(e.log_resource1){c |}{col 37}{res}{space 2}     0.58{col 49}{space 2}     0.15{col 77}{space 4}     0.35{col 90}{space 3}     0.96
{txt}{hline 36}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}corr(e.rec_vs_none,e.log_resource1){c |}{col 37}{res}{space 2}     0.01{col 49}{space 2}     1.07{col 60}{space 1}    0.01{col 69}{space 3} 0.99{col 77}{space 4}    -0.97{col 90}{space 3}     0.97
{txt}{hline 36}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(results {stata estimates replay rec_vs_none_time:rec_vs_none_time} are active now)

{hline}
{p 0 8}Model {hi:rec_vs_none_time}{p_end}
{hline}

Survival treatment-effects estimation{col 49}Number of obs {col 67}= {res}        32
{txt:Estimator}{col 16}:{res: IPW regression adjustment}
{txt:Outcome model}{col 16}:{res: Weibull}
{txt:Treatment model}{col 16}:{res: logit}
{txt:Censoring model}{col 16}:{res: none}
{txt}{hline 23}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 24}{c |}{col 36}    Robust
{col 1}                    _t{col 24}{c |}      Coef.{col 36}   Std. Err.{col 48}      z{col 56}   P>|z|{col 64}     [95% Con{col 77}f. Interval]
{hline 23}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}ATE                    {txt}{c |}
{space 11}rec_vs_none {c |}
(Recommended vs None)  {c |}{col 24}{res}{space 2}    -3.02{col 36}{space 2}     9.65{col 47}{space 1}   -0.31{col 56}{space 3} 0.75{col 64}{space 4}   -21.93{col 77}{space 3}    15.90
{txt}{hline 23}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}POmean                 {txt}{c |}
{space 11}rec_vs_none {c |}
{space 17}None  {c |}{col 24}{res}{space 2}    36.34{col 36}{space 2}     7.68{col 47}{space 1}    4.73{col 56}{space 3} 0.00{col 64}{space 4}    21.28{col 77}{space 3}    51.40
{txt}{hline 23}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(results {stata estimates replay rec_vs_nonrec_resource:rec_vs_nonrec_resource} are active now)

{hline}
{p 0 8}Model {hi:rec_vs_nonrec_resource}{p_end}
{hline}

Extended interval regression{col 49}Number of obs{col 67}= {res}        27
{txt}{col 49}   Uncensored{col 67}= {res}        24
{txt}{col 49}   Left-censored{col 67}= {res}         0
{txt}{col 49}   Right-censored{col 67}= {res}         3
{txt}{col 49}   Interval-cens.{col 67}= {res}         0

{txt}{col 49}Wald chi2({res}2{txt}){col 67}= {res}      1.93
{txt}Log likelihood = {res}-42.156242{txt}{col 49}Prob > chi2{col 67}= {res}    0.3813

{txt}{hline 38}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 39}{c |}      Coef.{col 51}   Std. Err.{col 63}      z{col 71}   P>|z|{col 79}     [95% Con{col 92}f. Interval]
{hline 38}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 16}meta_analysis_planned {c |}
{space 33}Yes  {c |}{col 39}{res}{space 2}     0.32{col 51}{space 2}     0.28{col 62}{space 1}    1.11{col 71}{space 3} 0.27{col 79}{space 4}    -0.24{col 92}{space 3}     0.87
{txt}{space 37} {c |}
{space 24}rec_vs_nonrec {c |}
{space 25}Recommended  {c |}{col 39}{res}{space 2}    -0.69{col 51}{space 2}     1.56{col 62}{space 1}   -0.44{col 71}{space 3} 0.66{col 79}{space 4}    -3.76{col 92}{space 3}     2.37
{txt}{space 32}_cons {c |}{col 39}{res}{space 2}     6.94{col 51}{space 2}     1.28{col 62}{space 1}    5.42{col 71}{space 3} 0.00{col 79}{space 4}     4.43{col 92}{space 3}     9.45
{txt}{hline 38}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}rec_vs_nonrec                         {txt}{c |}
{space 25}prespecified {c |}
{space 33}Yes  {c |}{col 39}{res}{space 2}    -0.26{col 51}{space 2}     0.56{col 62}{space 1}   -0.47{col 71}{space 3} 0.64{col 79}{space 4}    -1.37{col 92}{space 3}     0.84
{txt}{space 32}_cons {c |}{col 39}{res}{space 2}     0.92{col 51}{space 2}     0.44{col 62}{space 1}    2.11{col 71}{space 3} 0.03{col 79}{space 4}     0.07{col 92}{space 3}     1.78
{txt}{hline 38}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 18}var(e.log_resource1){c |}{col 39}{res}{space 2}     0.49{col 51}{space 2}     0.21{col 79}{space 4}     0.21{col 92}{space 3}     1.15
{txt}{hline 38}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}corr(e.rec_vs_nonrec,e.log_resource1){c |}{col 39}{res}{space 2}     0.24{col 51}{space 2}     1.24{col 62}{space 1}    0.20{col 71}{space 3} 0.84{col 79}{space 4}    -0.98{col 92}{space 3}     0.99
{txt}{hline 38}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(results {stata estimates replay rec_vs_nonrec_time:rec_vs_nonrec_time} are active now)

{hline}
{p 0 8}Model {hi:rec_vs_nonrec_time}{p_end}
{hline}

Survival treatment-effects estimation{col 49}Number of obs {col 67}= {res}        26
{txt:Estimator}{col 16}:{res: IPW regression adjustment}
{txt:Outcome model}{col 16}:{res: Weibull}
{txt:Treatment model}{col 16}:{res: logit}
{txt:Censoring model}{col 16}:{res: none}
{txt}{hline 34}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 35}{c |}{col 47}    Robust
{col 1}                               _t{col 35}{c |}      Coef.{col 47}   Std. Err.{col 59}      z{col 67}   P>|z|{col 75}     [95% Con{col 88}f. Interval]
{hline 34}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}ATE                               {txt}{c |}
{space 20}rec_vs_nonrec {c |}
(Recommended vs Non-recommended)  {c |}{col 35}{res}{space 2}     3.83{col 47}{space 2}     8.79{col 58}{space 1}    0.44{col 67}{space 3} 0.66{col 75}{space 4}   -13.39{col 88}{space 3}    21.06
{txt}{hline 34}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}POmean                            {txt}{c |}
{space 20}rec_vs_nonrec {c |}
{space 17}Non-recommended  {c |}{col 35}{res}{space 2}    30.87{col 47}{space 2}     5.66{col 58}{space 1}    5.45{col 67}{space 3} 0.00{col 75}{space 4}    19.77{col 88}{space 3}    41.97
{txt}{hline 34}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(results {stata estimates replay any_vs_none_resource:any_vs_none_resource} are active now)

{hline}
{p 0 8}Model {hi:any_vs_none_resource}{p_end}
{hline}

Extended interval regression{col 49}Number of obs{col 67}= {res}        38
{txt}{col 49}   Uncensored{col 67}= {res}        35
{txt}{col 49}   Left-censored{col 67}= {res}         0
{txt}{col 49}   Right-censored{col 67}= {res}         3
{txt}{col 49}   Interval-cens.{col 67}= {res}         0

{txt}{col 49}Wald chi2({res}2{txt}){col 67}= {res}     10.37
{txt}Log likelihood = {res}-64.982942{txt}{col 49}Prob > chi2{col 67}= {res}    0.0056

{txt}{hline 36}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 37}{c |}      Coef.{col 49}   Std. Err.{col 61}      z{col 69}   P>|z|{col 77}     [95% Con{col 90}f. Interval]
{hline 36}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 14}meta_analysis_planned {c |}
{space 31}Yes  {c |}{col 37}{res}{space 2}     0.99{col 49}{space 2}     0.31{col 60}{space 1}    3.17{col 69}{space 3} 0.00{col 77}{space 4}     0.38{col 90}{space 3}     1.61
{txt}{space 35} {c |}
{space 24}any_vs_none {c |}
{space 31}Any  {c |}{col 37}{res}{space 2}    -0.43{col 49}{space 2}     0.55{col 60}{space 1}   -0.77{col 69}{space 3} 0.44{col 77}{space 4}    -1.52{col 90}{space 3}     0.66
{txt}{space 30}_cons {c |}{col 37}{res}{space 2}     5.97{col 49}{space 2}     0.41{col 60}{space 1}   14.42{col 69}{space 3} 0.00{col 77}{space 4}     5.16{col 90}{space 3}     6.79
{txt}{hline 36}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}any_vs_none                         {txt}{c |}
{space 30}field {c |}
{space 27}Welfare  {c |}{col 37}{res}{space 2}     0.59{col 49}{space 2}     0.31{col 60}{space 1}    1.89{col 69}{space 3} 0.06{col 77}{space 4}    -0.02{col 90}{space 3}     1.20
{txt}{space 30}_cons {c |}{col 37}{res}{space 2}     0.28{col 49}{space 2}     0.25{col 60}{space 1}    1.13{col 69}{space 3} 0.26{col 77}{space 4}    -0.21{col 90}{space 3}     0.76
{txt}{hline 36}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 16}var(e.log_resource1){c |}{col 37}{res}{space 2}     1.34{col 49}{space 2}     0.55{col 77}{space 4}     0.61{col 90}{space 3}     2.98
{txt}{hline 36}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}corr(e.any_vs_none,e.log_resource1){c |}{col 37}{res}{space 2}     0.95{col 49}{space 2}     0.08{col 60}{space 1}   12.47{col 69}{space 3} 0.00{col 77}{space 4}     0.25{col 90}{space 3}     1.00
{txt}{hline 36}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}(results {stata estimates replay any_vs_none_time:any_vs_none_time} are active now)

{hline}
{p 0 8}Model {hi:any_vs_none_time}{p_end}
{hline}

Survival treatment-effects estimation{col 49}Number of obs {col 67}= {res}        38
{txt:Estimator}{col 16}:{res: IPW regression adjustment}
{txt:Outcome model}{col 16}:{res: Weibull}
{txt:Treatment model}{col 16}:{res: logit}
{txt:Censoring model}{col 16}:{res: none}
{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}                   _t{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}ATE                   {txt}{c |}
{space 10}any_vs_none {c |}
{space 7}(Any vs None)  {c |}{col 23}{res}{space 2}    -2.48{col 35}{space 2}     9.15{col 46}{space 1}   -0.27{col 55}{space 3} 0.79{col 63}{space 4}   -20.41{col 76}{space 3}    15.45
{txt}{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}POmean                {txt}{c |}
{space 10}any_vs_none {c |}
{space 16}None  {c |}{col 23}{res}{space 2}    37.97{col 35}{space 2}     7.98{col 46}{space 1}    4.76{col 55}{space 3} 0.00{col 63}{space 4}    22.34{col 76}{space 3}    53.60
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. // Save the report to the specified filename.
. putdocx save "${c -(}report_filename{c )-}", replace
{res}successfully replaced {browse "/Users/cjr/Repos/fhi.ml-resource-time.2023/products/ml-resource-time-report.docx":"/Users/cjr/Repos/fhi.ml-resource-time.2023/products/ml-resource-time-report.docx"}
{txt}
{com}. 
{txt}end of do-file

{com}. 
{txt}end of do-file

{com}. 